[{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8671f"
	},
	"name": "Acme Farm",
	"description": "Acme Farm raises grass-fed, antibiotic-, chemical-, and grain-free lamb. We follow organic practices on our farm. Our uncommon sheep are a hardy, ancient breed, considered to be a genetic resource for now and the future. They are a small, hardy, hair sheep breed that carries their fat around their internal organs, which means a low-fat, fine textured and mild flavored meat.  All processing is USDA inspected. We usually have ground lamb, chops, legs-of-lamb, shanks, and two types of sausage, spicy Italian and breakfast, available. You may special order whole lamb or other cuts or varietal portions to be reserved at the next harvest.             Contact Nancy by phone or e-mail to arrange for farm  sales. Our lamb is also available at Everybody's Store (http://www.everybodys.com) in Van Zandt, and Farmer Ben™s (http://www.myfarmerben.com) between Everson and  Lynden,  all in Whatcom County, WA.          Acme Farm, Nancy Hibbing, 5808 Saxon Road, Acme WA (https://www.google.com/maps?q=5808+Saxon+Road,+Acme+WA+9822\u0026hl=en\u0026ll=47.820532,-122.085571\u0026spn=2.452748,5.300903\u0026sll=37.0625,-95.677068\u0026sspn=46.005754,84.814453\u0026hnear=5808+Saxon+Rd,+Acme,+Whatcom,+Washington+98220\u0026t=m\u0026z=8) 98220. (360) 722-1322.        E-mail: acmefarm@msn.com",
	"products": [
		"Lamb"
	],
	"location": {
		"city": "Acme",
		"state": "Washington",
		"coordinates": [
			122.17294700000001,
			48.687958,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86720"
	},
	"name": "Acres in Zion",
	"description": "Acres in Zion in Enumclaw, Washington raises natural grass fed and grass finished beef; primarily Angus and Herefords.  You can rest assured we do not use antibiotics or growth hormones in our animals. They graze on the lush pastures along the Newaukum Creek near Enumclaw, and in winter are fed quality hay from a local certified organic farm.   The animals are processed locally and cut and wrapped to your specifications.  We may be reached by phone or by email. Please visit our website for more information about us. Acres in Zion, Eric Robb, Enumclaw, WA (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026q=Enumclaw,+Washington\u0026sll=37.0625,-95.677068\u0026sspn=46.005754,64.511719\u0026ie=UTF8\u0026cd=1\u0026geocode=FQ9F0AIddpW6-A\u0026split=0\u0026ll=47.189712,-121.992187\u0026spn=19.868396,32.255859\u0026z=5). (253) 736-4848. E-mail: ericrobb@zionbeef.com",
	"Website": " http://www.zionbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Enumclaw",
		"state": "Washington",
		"coordinates": [
			121.98977000000001,
			47.203599,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86721"
	},
	"name": "Agape Wells Farm",
	"description": "Agape Wells Farm produces natural grass-fed beef for folks throughout Washington. At Agape Wells we try to raise the best beef possible, beef that is both healthy to eat and flavorful. We approach this goal in 3 ways: raising a select breed of cattle, feeding only natural grass, and providing a quiet stress-free environment. First, we raise only Angus beef. Angus cattle are noted for their marbled meat, making it juicy and tender. Second, we work hard to produce pastures with a high quality mix of grasses and legumes for our cattle to eat. They drink pure water from our artesian well. We supplement with minerals developed especially for our area to provide them with the nutrients they need for healthy growth. No growth hormones or antibiotics are used.  Third, we maintain a low stress environment. The folks on our farm interact with the cattle in a way to ensure they are familiar and comfortable with each of us. As a result, they are easily moved from pasture to pasture with little more than a whistle from the newly opened gate. This keeps our cattle content and producing the best beef possible. For those who insist on the very best, only pasture finished Angus beef will do. So, when you think about that juicy steak, fall off the fork tender beef roast, or the best hamburger you will put your hands around, we hope you will think about Agape Wells' Angus beef.  We hope you will give our beef a try. Visitors to our farm are always welcome. Just give us a call. Agape Wells Farm, Cheryl and David, 10790 Upper Badger Pocket Road, Ellensburg WA 98926. (509) 968-3365.  E-mail: agapewells@fai",
	"website": " http [://www.agapewells.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Ellensburg",
		"state": "Washington",
		"coordinates": [
			120.318191,
			46.872124,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86722"
	},
	"name": "Akyla Farms",
	"description": "Chicken, pork, eggs.  Akyla Farms offers pastured chicken, pastured pork and farm fresh eggs from our small laying flock.  At Akyla Farms pastures are the cornerstone of the farm and we enjoy seeing and hearing our animals happy and healthy, eating what mother nature intended them to eat. The meat chickens are housed in bottomless pens that are dragged to a fresh piece of pasture everyday following a small cow herd. In the brush, the pigs enjoy rooting in the dirt and clearing the land behind an electrified netting and are moved to a new location before they run out of green vegetation. Chickens, ducks and geese make-up the laying flock and are allowed to roam in the yard and wooded areas as they wish.  Please visit our website for more information and let us know if you would like to visit one of our farm locations to hear the animals munching away or to pick up eggs. Akyla Farms, Carol \u0026 Kevin Osterman, 24498 Polte Road, Sedro Woolley WA 98284 (https://www.google.com/maps?q=24498+Polte+Road,+Sedro+Woolley+WA+98284\u0026hl=en\u0026ll=48.215523,-122.294312\u0026spn=1.116385,2.532349\u0026sll=37.0625,-95.677068\u0026sspn=42.310334,81.035156\u0026hnear=24498+Polte+Rd,+Sedro-Woolley,+Washington+98284\u0026t=m\u0026z=9). (360) 941-1533. E-mail: barnyard@akylafarms.com",
	"website": " http://www.akylafarms.com",
	"products": [
		"Chicken",
		"Pork",
		"Eggs"
	],
	"location": {
		"city": "Sedro-Woolley",
		"state": "Washington",
		"coordinates": [
			122.21410000000002,
			48.51222,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86723"
	},
	"name": "Amazing Grace Highlands",
	"description": "Amazing Grace Highlands “ Beef for the discriminating beef connoisseur! NO ANTIBIOTICS¦..NO STEROIDS¦.NO CHEMICALS AT ALL!   *Organic practices are strictly followed, but we are not certified organic*  At Amazing Grace Highlands we raise only Scottish Highland cattle, currently 40 head and growing. Noted for their lean, nutritious meat that tastes like beef used to taste, our cattle are grass fed and grass finished. This is how nature intended cattle to eat.  Our lush Stillaguamish Valley pastures are grazed using intensive grazing management practices whereby the cattle are given enough grass for 2 or 3 days and then moved to an adjacent section. We repeat this process for 20-30 days, thus allowing the grass to recover before re-grazing it. This sustainable practice creates healthy forage without the use of pesticides or herbicides as the grass out-competes weed growth.  Additionally, we empty and scrub their water troughs to provide the cleanest and healthiest drinking water for our cattle. This is done every time we move them to their next grazing section.   We grow and harvest all of our own haylage for winter feeding, assuring content and quality!  Humanely raised in a beautiful environment and being humanely harvested are IMPORTANT both to us and to you. Upon harvest, our beef is dry aged 17-21 days creating a full-flavored, premium aged product. It is orderable by the quarter, half or whole in the fall and sometimes in the spring as well.  Amazing Grace Highlands, Mark and Debbie Klein, Arlington, WA (http://maps.google.com/maps?q=Arlington,+WAhl=enll=48.195387,-122.124023spn=5.859357,12.974854sll=37.0625,-95.677068sspn=55.016555,103.798828z=7). (425) 231-4993 (Mark), (425) 231-0250 (Debbie)  E-mail: lotwg@hotmail.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Arlington",
		"state": "Washington",
		"coordinates": [
			122.12514199999998,
			48.198712,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86724"
	},
	"name": "American Alps Ranch ",
	"description": "American Alps Ranch is proud to offer you our all natural grass fed, grass finished Lowline Angus Beef. We raise our cattle on our beautiful ranch in the Skagit River Valley of Washington state. We are a small, family-owned ranch.   No hormones, steroids, grains or antibiotics are ever used on our animals. They eat grass”the food nature intended”and drink pure water straight off the North Cascade mountains. Our Angus cattle graze freely on lush pastures in the fresh air and sunshine. This is good for our cattle, good for the environment and good for you. We use MIG (Management Intensive Grazing) to ensure the very best grass for our cattle and the long-term sustainability of our pastures.  At the peak of their flavor, our cattle are harvested by the IGFC, a local USDA Inspected and Certified Farmer™s Co-Op which comes to our ranch, reducing stress on the animals. Each one of our animals is individually inspected and certified by the on-site USDA inspector, guaranteeing our customers a healthy product. We strictly follow all the requirements for Organic though we are not certified. And the grass fed flavor of our beef is delicious!  Local Delivery! We heartily support the œBuy Local, Eat Local philosophy. For this reason, we offer local delivery to our customers in the greater Seattle and Bellingham, Washington areas. Once a month we load our truck here at the ranch with our healthy and nutritious grass fed beef and make deliveries to pre-arranged central locations down the Hwy 20, I-5 \u0026 405 corridors from Bellingham to Seattle. This great service saves you on shipping costs (only $25 per delivery), saves the environment with one combined trip, and you get our delicious, grass fed beef conveniently delivered to you. What could be better than that? American Alps Ranch, Rick and Brenda Palmer, PO Box 339, Marblemount WA (http://g.co/maps/huvdk) 98267. (360) 873-4507.  E-mail: info@americanalpsranch.com",
	"website": " http://www.americanalpsranch.com\u003c\\/a\u003e. (http://www.americanalpsranch.com)",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Marblemount",
		"state": "Washington",
		"coordinates": [
			121.44957299999999,
			48.527619,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86725"
	},
	"name": "August Farm",
	"description": "August Farm is a small-scale, pasture based, diversified livestock and flower farm. We are located in Independence Valley, a vibrant farming community, 30 miles south of Olympia, Washington. Our mission is to produce healthy, organic, humanely raised, pastured meat. We strive to preserve heritage breeds, be stewards of the land, and reinvigorate our local economy. Our priority is to provide our livestock with the highest animal welfare and supply our community with the highest quality meat. We raise free-range chickens, whey-fed pigs, grass fed lamb and specialty cut flowers. All of our animals graze on pasture and are fed local and/or certified organic feed. They are raised outside in a safe, comfortable environment that honors their natural instincts. They are slaughtered on farm to reduce the stress of transport and are sold directly to our customers.  Pasture Raised Chicken is Better for the Environment and Better for You. Our chickens are raised seasonally, outdoors, on pasture, where they can flap their wings, take dust baths and eat crickets, worms and grass. We supplement their foraging with non-GMO certified organic feed. Our chickens have been bred to grow more slowly than industrial breeds. The more natural growing period results in superior, old-fashion tasting chicken with a deep, rich flavor our grandparents would recognize.  Purchase whole chickens delivered monthly through our Chicken CSA program to Portland, Olympia, Tacoma and Seattle. Our pork is sold by the half or whole. You can buy a whole grass fed lamb, they are ready in November. Check out our website for more details or contact us to place an order or ask questions. August Farm, Liza Judge, Marianne Copene, 11545 Independence Road, Rochester WA 98579. (801) 859-6598.  E-mail: info@august-farm.com",
	"website": " http://www.august-farm.com",
	"products": [
		"Chicken",
		"Pork",
		"Lamb"
	],
	"location": {
		"city": "Rochester",
		"state": "Washington",
		"coordinates": [
			123.127427,
			46.802681,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86726"
	},
	"name": "Autumn Hills Woollens \u0026 Sheep Co. ",
	"description": "Autumn Hills Woollens and Sheep Co. raises sheep for wool and for market lamb production.  We raise Merino and Bluefaced Leicester for wool. Our market lambs will be crosses from Bluefaced Leicester, Border Leicester and then finished with a Dorper Ram.  Our breeding strategy centers around sheep that do well in high rainfall areas and sheep that can gain weight easily on pasture grass (grazing in good weather and fed grass hay cut from the same field during inclement weather in a sheltered area). We do not feed our sheep grain.  Autumn Hills Woollens \u0026 Sheep Co., Jeffry Seldomridge and Patricia Keeley, 685 Boistfort Road, Curtis WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=685+Boistfort+Road,+Curtis+WA+98538\u0026sll=46.587476,-123.118629\u0026sspn=0.041291,0.062485\u0026ie=UTF8\u0026ll=46.587417,-123.118629\u0026spn=0.165163,0.249939\u0026z=12\u0026iwloc=addr) 98538. (360) 623-5398.   E-mail: autumnhillswoollens@live.com (autumnhillswoollens@live.com).  ",
	"website": " http://www.autumnhillswoollens.com",
	"products": [
		"Lamb",
		"Wool"
	],
	"location": {
		"city": "Curtis",
		"state": "Washington",
		"coordinates": [
			123.118608,
			46.587486,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86727"
	},
	"name": "Baron Farms",
	"description": "Baron Farms raises grass fed Beef, pasture raised Pork, and pasture raised Chicken on lush pastures in the Yakima Valley. Beef is offered by the 1/8th, 1/4, half and whole packages. Smaller beef packages and ground beef packages are also available. Pork is offered by the half or whole package.  Our animals spend their lives peacefully grazing on our high quality grass and legume-based pastures. We rotate our animals to ensure they always receive the highest quality and quantity of pasture. Our pigs' pasture diet is supplemented with fruit and vegetables from our produce garden. At no time do we use antibiotics or hormones.  Customers can pick up their beef and/or pork or we can ship for a nominal fee. We offer shipping to customers within the states of Washington, Oregon, and Idaho.  Baron Farms, LLC, Cameron Baron, 2971 West Wapato Road, Wapato WA 98951 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=2971+West+Wapato+Road,+Wapato+WA+98951\u0026sll=37.0625,-95.677068\u0026sspn=30.185946,61.259766\u0026ie=UTF8\u0026hq=\u0026hnear=2971+W+Wapato+Rd,+Wapato,+Yakima,+Washington+98951\u0026ll=46.448355,-120.492281\u0026spn=3.277663,7.657471\u0026z=7). (866) 9MY-BEEF (866.969.2333). E-mail: cbaronhj7@gmail.com (cbaronhj7@gmail.com).",
	"website": " http://www.baronfarms.com",
	"products": [
		"Beef",
		"Pork",
		"Chickens"
	],
	"location": {
		"city": "Wapato",
		"state": "Washington",
		"coordinates": [
			120.49228099999999,
			46.448355,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86728"
	},
	"name": "Basket Flat Ranch",
	"description": "Basket Flat Ranch is located in the Pacific        Northwest, near Battle Ground, Washington. Basket Flat Ranch utilizes        the mild, wet climate, longer growing season, and lush pastures to produce        a superior, all natural, grass fed beef product for your dinner table.                   We feed our beef animals only grass and clover pasture and locally grown        grass and clover hay during the Winter season. We fertilize our        pastures with manure and manure compost and avoid the use of chemical        fertilizer.             We do not use any hormones or anti-biotics and we are a small ranch with        tame animals that we personally work with in a low stress manner.              We raise Angus beef (both red and black color), and we are constantly selecting        genetics in our breeding stock for the best tenderness, marbling, and steak thickness.            We are passionate about raising beef with all natural techniques and carefully        taking care of and stewarding our animals and pastures year after year so we        can produce a healthy beef product for our table and yours.             We serve the S.W. Washington and Portland, OR Metro area. Our beef is        available for pick up from a local butcher in Battle Ground, WA.  Please        visit our web site for ordering, quantities, pricing and availability.              Basket Flat Ranch, Jon Schoenborn, 21309          NE Basket Flat Road, Battle Ground WA 98604 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=21309+NE+Basket+Flat+Road,+Battle+Ground+WA+98604\u0026sll=37.0625,-95.677068\u0026sspn=48.374125,79.013672\u0026ie=UTF8\u0026hq=\u0026hnear=21309+NE+Basket+Flat+Rd,+Battle+Ground,+Clark,+Washington+98604\u0026ll=45.833431,-122.454124\u0026spn=5.358105,9.876709\u0026z=7). (360) 601-5918.          E-mail: jons@basketflatranch.com (mailto:jons@basketflatranch.com).",
	"website": " http://www.basketflatranch.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Battle Ground",
		"state": "Washington",
		"coordinates": [
			122.454124,
			45.833431,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86729"
	},
	"name": "BCS Livestock",
	"description": "BCS Livestock raises natural grass-fed               lamb and pastured farm fresh eggs. We also sell wool               blankets made from the wool of our sheep. Our goal is to raise our               animals humanely and deliver a natural, wholesome product while               sustaining and improving the land.               Our products are available direct from the farm.               Please call or e-mail.              BCS Livestock, Skip, Betsy and Casey Smith,               19100              Highway 20, Winthrop WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=WA-20,+Winthrop,+Okanogan,+Washington+98862,+United+States\u0026sll=47.26082,-122.510486\u0026sspn=0.07421,0.133896\u0026ie=UTF8\u0026cd=1\u0026ll=48.472921,-120.179443\u0026spn=4.639699,8.569336\u0026z=7\u0026iwloc=addr\u0026om=1)  98862. (509) 996-3159.                E-mail: drbetsy@methownet.com (mailto:drbetsy@methownet.com)",
	"products": [
		"Lamb",
		"Eggs"
	],
	"location": {
		"city": "Winthrop",
		"state": "Washington",
		"coordinates": [
			120.19455,
			48.477929,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672a"
	},
	"name": "Bob's Beef ",
	"description": "Bob's Beef raises grass-fattened beef in Monroe, Washington.   Bob's farm began as a dairy 30 years ago. After selling the milk cows in December 2000, we decided to get a few beef cattle. A few cattle have turned into a herd of 18 Herefords and Angus. Our cattle are born on the farm in a closed herd and they are not in contact with any other herds, so there is less chance of bringing in any disease.   Our animals are grass fed and in winter they get top quality hay. they are not fed hormones, antibiotics, or any animal by-products. They are free to roam from the pastures to the shelter of the barns as they choose. We are a small farm so our cattle can be in an uncrowded, stress-free atmosphere.   Bob's Beef, Bob or Kathy Nash, 22630 Sofie Road, Monroe WA 98272 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=22630+Sofie+Road,+Monroe+WA+98272\u0026sll=37.0625,-95.677068\u0026sspn=45.957536,68.818359\u0026ie=UTF8\u0026hq=\u0026hnear=22630+Sofie+Rd,+Monroe,+Snohomish,+Washington+98272\u0026ll=47.851521,-121.929941\u0026spn=2.447755,4.301147\u0026z=8). (360) 794-8829.   E-mail: kathynash@wildblue.net (kathynash@wildblue.net).",
	"website": " http://www.bobsbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Monroe",
		"state": "Washington",
		"coordinates": [
			121.929941,
			47.851521,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672b"
	},
	"name": "Bone Dry Ridge",
	"description": "Bone Dry Ridge Farm raises Icelandic Sheep, Scottish Highland Cattle, pigs and chickens. All are raised using organic practices but we are not certified.   They spend their summers out on pastures or in a small wooded area. Over winter the sheep and cows are fed local hay. The pigs and chickens are fed certified organic grain. Our job is to make sure they have a healthy happy life. Healthy and happy creatures are a delight to take care of.     We sell beef, lamb, pork, and eggs directly to consumers. To purchase from us, please contact us and we will add you to the mailing list. If you would like to know more about the farm, look at the website and/or contact us directly via email or phone. For sheep skins and raw wool contact us for availability.    Bone Dry Ridge, Selma Bjarnadottir, 209 Hyppa Road East, Rochester WA 98579 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=209+Hyppa+Road+East,+Rochester+WA+98579\u0026sll=37.0625,-95.677068\u0026sspn=46.543597,79.013672\u0026ie=UTF8\u0026hq=\u0026hnear=209+Hyppa+Rd+E,+Rochester,+Lewis,+Washington+98579\u0026ll=46.784561,-123.16888\u0026spn=5.062676,9.876709\u0026z=7). (360) 273-1045.  E-mail: selma@bonedryridge.com (selma@bonedryridge.com).",
	"website": " http://www.bonedryridge.com",
	"products": [
		"Beef",
		"Pork",
		"Lamb",
		"Eggs"
	],
	"location": {
		"city": "Rochester",
		"state": "Washington",
		"coordinates": [
			123.16888,
			46.784561,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672c"
	},
	"name": "Botany Bay Farm",
	"description": "At Botany Bay Farm we use rotational grazing practices to produce healthy, contented animals, nourishing food and fertile, sustainable land. We currently raise and sell Pastured Chicken, Eggs, Rabbit, Beef, and Forest-Raised Pork as well as Rototiller Pork. All of our meat and eggs are 100% hormone- and antibiotic-free. We supplement our Pasture Raised Broilers, Layers, Rabbits, and Pigs with a soy-free and GMO-free feed (most of which is milled fresh on farm). The majority of our animals are processed on farm. Our Pasture Raised Chicken is available from the end of May through the beginning of October. We offer whole birds, cuts (quarters, boneless skinless breasts, and wings), broth parts, and organs on farm. You can also purchase our whole birds at any New Seasons Market or Chuck™s Produce \u0026 Street Market. Our Pasture-Raised Eggs are available year round and can also be purchased on farm or at New Seasons Market or Chuck™s Produce \u0026 Street Market. Our Forest-Raised Pork (available in the fall) and Rototiller Pork (available in the winter) are sold by the whole or half pig. Please check out our website for more information about our farm as well as product pricing. You can contact us if you have any questions about the products we offer or our farming practices. Be sure and check out our farm blog to see what's happening on the farm! Botany Bay Farm, Heidi Sturtevant, 13513 NE 132nd Avenue, Brush Prairie WA 98606. (360) 524-9005. E-mail: info@botanybayfarm.com",
	"website": " www.botanybayfarm.com",
	"products": [
		"Chicken",
		"Eggs",
		"Rabbit",
		"Beef",
		"Pork"
	],
	"location": {
		"city": "Brush Prairie",
		"state": "Washington",
		"coordinates": [
			122.5358423,
			45.720673600000005,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672d"
	},
	"name": "Bradrick Family Farms",
	"description": "Bradrick Family Farms Bradrick Family Farms near                      Montesano, Washington”Contact                    us for naturally healthful and delicious farm products, and                    enjoy getting to know your farmers and exactly where your                  food comes from!                   Our livestock is raised from start-to-finish                      on abundant, lush pasture. They are given no antibiotics,                      hormones, GMO's, animal by-products, synthetic chemicals,                    etc.                       Our healthy, happy chickens feed                      daily on quality grain and fresh pasture for the best of                      both health benefits and flavor. Pastured beef and lamb                    (when                      available) are fed flourishing grasses and natural minerals                      only. The result?   Reliably,                    health-building, farm fresh food for your table”delicious,                      tender meats, and beautiful, flavorful brown eggs                      with the yellowest yolks you have ever seen, both                      of which you can eat \u0026 enjoy                    with a good conscience! March 2013: Look for updates to our website coming soon.                     Bradrick Family Farms, Philip Bradrick, 25                    Geissler Road, Montesano WA 98563 (http://www.google.com/maphp?hl=en\u0026tab=wl\u0026q=25%20Geissler%20Road%2C%20Montesano%20WA%2098563). (360) 249-2472. E-mail: bradricks@intergate.com                   ",
	"website": " http://www.BradrickFamilyFarms.com",
	"products": [
		"Beef",
		"Lamb",
		"Eggs"
	],
	"location": {
		"city": "Montesano",
		"state": "Washington",
		"coordinates": [
			123.654124,
			47.008232,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672e"
	},
	"name": "Bright Ide Acres",
	"description": "Snohomish, WA. Pork, chickens, turkeys, eggs, goat, lamb. Bright Ide Acres is a small, diverse livestock farm located in the beautiful Snohomish River Valley, 40 miles northeast of Seattle. The farm is operated by Andrew and Micha Ide, a young couple whose big passion is ethically raised meat. Too often the meat found in the grocery stores comes from animals who weren™t allowed to live natural lives. In addition to the ethical issues raised, the meat from such animals is less nutritious and flavorful than it should be.  We are dedicated to providing our animals with the best care possible, and all are rotated onto fresh pasture or in wooded lots. The goats browse our prolific blackberry bushes, the pigs root up grubs, grass, and roots, and the poultry scratch and peck at fresh greens and protein-dense insects. The meat and eggs harvested from such creatures far surpass what is commercially available, and we encourage our friends and neighbors to give it a try. We also welcome all who are interested to come and visit us at the farm to see firsthand how our animals are raised. We are proud of our high standards, and we think you will be too.  We currently offer custom pork by the half or whole hog, whole pastured chickens, heritage turkeys for Thanksgiving, pastured eggs, whole grass-fed goat, and whole grass-fed lamb. Our pigs and poultry are fed non-GMO (corn- and soy-free) feed grown and milled in Washington State. Our pastures are pesticide- and herbicide-free.  Please visit our website for more information or send us an email. We™d be happy to talk to you and show you our farm. Thank you for supporting local agriculture and ethically raised meat! Bright Ide Acres, Micha and Andrew Ide, PO Box 1156, Snohomish, WA 98291. (360) 282-0252. E-mail: brightideacres@gmail.com",
	"website": " www.brightideacres.com",
	"products": [
		"Pork",
		"Turkey",
		"Chicken",
		"Eggs",
		"Goat",
		"Lamb"
	],
	"location": {
		"city": "Snohomish",
		"state": "Washington",
		"coordinates": [
			122.09818480000001,
			47.91287560000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8672f"
	},
	"name": "Buckleberry Farm",
	"description": "Buckleberry Farm is our \"hobbit-farm\"              in Milton-Freewater, OR. Everything is on a small scale for now.                We raise fruit, vegetables, poultry, and bottle, can and                have a bakery in our home using all our little farm produces.                We take these products to the Walla Walla Farmers Market and                sell to folks by phone and e-mail orders.  We dry and roast                fruits and nuts as well and run the bakery one full day a week.                 We have also started bottling our blackberries into an Oregon                blackberry BBQ sauce and other items.              We raise, for now, 20 Bronze Turkey pasture-fed              per year and 20 broilers two times a year to freeze and sell smoked              as well. Building our own smokehouse now! Looking forward to expanding              and developing our knowledge and facilities! We also raise miniature              horses and love to cart them down country roads. We love farm life...any              interest you have in what we do, please contact us via e-mail!             Buckleberry Farm, Chuck and Cindi Hudgins, 85180                Hurst Lane, Milton-Freewater, OR (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=85180+Hurst+Lane,+Milton-Freewater,+OR\u0026sll=47.269169,-122.47624\u0026sspn=0.01025,0.016823\u0026ie=UTF8\u0026ll=45.981695,-118.399658\u0026spn=5.374662,8.613281\u0026z=7\u0026iwloc=addr\u0026om=1) 97862.  (541) 938-5352.               E-mail: buckleberry@charter.net (mailto:buckleberry@charter.net).            ",
	"website": " http://www.buckleberryfarm.com",
	"products": [
		"Chicken",
		"Turkey"
	],
	"location": {
		"city": "Milton-Freewater",
		"state": "Oregon",
		"coordinates": [
			118.39481,
			45.985304,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86730"
	},
	"name": "Card's L Hanging S Ranch ",
	"description": "Card's L Hanging                      S Ranch Grass Fat Beef”Our cattle have spent                      all their lives on our place, near Prosser in the Lower                      Yakima Valley. They and their mothers and grandmothers                      have eaten only what we raise: good grass and hay. No antibiotics                      or growth stimulants.         We sold out last year, so call us soon if you want to be on the list for September/October 2011. We charge by the pound hanging weight; in addition the buyer pays cut, wrap, and farm harvest by local meat cutter. Beef is available by the whole, half or split half with a $200 deposit before harvest.        Card's L Hanging S Ranch, Charlie and Linda Card, 7102          South Steele Road, Prosser WA 99350 (http://www.google.com/maphp?hl=en\u0026tab=wl\u0026q=7102%20South%20Steele%20Road%2C%20Prosser%20WA%2099350). (509) 786-4970. Charlie's          cell:         (509) 788-1234. Linda's cell: (509) 788-1005.",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Prosser",
		"state": "Washington",
		"coordinates": [
			119.804785,
			46.205211000000006,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86731"
	},
	"name": "Cascade Range Beef Company",
	"description": "Cascade               Range Beef Company is a family of              ranches located west of the Cascade Range in the state of Washington.              Some of our ranches are in Snohomish County and East King County.              Our ranchers share a common commitment to responsible, sustainable              farming practices, and humane care is given to each animal.               Each              animal is individually inspected and tracked to assure the maximum              health benefits. No antibiotics, growth hormones, steroids, or              processing additives are allowed. Our strict protocols require              British breeds known to flourish on all-grass, 100% vegetarian              diets in our local climate. The animals always get plenty of exercise              and fresh, green forages, and are free to graze on hundreds of              acres of pastureland.              We sell our beef in whole, halves, and quarters.              Our grassfed beef is generally available from spring through late              fall. A deposit is required to reserve your beef.             Cascade Range Beef Company, Lucy Campos, mailing               address: c/o Mr. Robert Richards, 25224 132nd Street SE, Monroe               WA (http://www.mapquest.com/maps/map.adp?country=US\u0026address=\u0026city=Monroe\u0026state=WA)  98272.              (206) 355-2468. E-mail: cascaderangebeef@gmail.com (mailto:cascaderangebeef@gmail.com).",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Monroe",
		"state": "Washington",
		"coordinates": [
			121.893237,
			47.878085,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86732"
	},
	"name": "Chinook Farms",
	"description": "Chinook Farms is a 132-acre diversified farm in the fertile Snohomish River Valley. Our goal is        to produce local, fresh organic produce, grass fed and finished beef, and pastured poultry to        help sustain and support local agriculture. Our beef is available mostly in the fall months and occasionally during the rest of the year. Our Freedom Ranger chickens, also known as Red Rangers, are raised during the warmer months. They can be reserved by email or through our website with a $5.00 per bird deposit.        We raise our cattle on  pastures that  are certified organic by WSDA. All their feed comes from the farm, mostly  through rotational grazing and augmented with our own hay. We have also  earned the Salmon Safe designation.  We sell our beef by the 1/4, 1/2,  or whole portions. We are able to ship our frozen beef to some parts of Alaska  served by Alaska Marine Lines.                      We prefer payments by check or cash but do accept credit and  debit cards* through Square (www.squareup.com (http://www.squareup.com)).           (* Fees  may apply for credit and debit card transactions.)                Chinook Farms, Eric Fritch, (425)  508-6341.        Mailing address: 18507 Waverly Drive, Snohomish WA 98296.          Farm address: 10601 Elliott Rd, Snohomish, WA (https://www.google.com/maps?q=10601+Elliott+Rd,+Snohomish,+WA\u0026hl=en\u0026ll=47.842658,-122.091064\u0026spn=2.728319,6.366577\u0026sll=37.0625,-95.677068\u0026sspn=51.04407,101.865234\u0026hnear=10601+Elliott+Rd,+Snohomish,+Washington+98296\u0026t=m\u0026z=8) 98296 (By A          E-ma [il: eric@chinookfarms.com",
	"website": " http://www.chinookfarms.com",
	"products": [
		"Beef",
		"Chicken"
	],
	"location": {
		"city": "Snohomish",
		"state": "Washington",
		"coordinates": [
			122.08983200000002,
			47.843321,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86733"
	},
	"name": "Clear Valley Farm",
	"description": "Clear Valley Farm raises heritage breed Angus that are meant for a grass-finished beef program and provide smaller portions for a healthier lifestyle.  Our cattle are on pasture in their natural environment year round. Their grazing pastures have been free of chemicals and commercial fertilizers for over 40 years. Along with pasture rotation, we practice calm handling practices by having a common water facility and alley way that allows for stress-free movement of cattle during rotations.  Our beef is available year around as supply allows. It is processed USDA which allows us to sell by the cut or you may purchase a half a whole or our stockman package. Information can be found on our website under the \"For Sale\" tab. Our beef is currently available at our farm. Limited cuts are available at Garden Treasures Organic Farm \u0026 Nursery in Arlington. We also participate in the Marysville and Port Susan Farmers Markets. Clear Valley Farm, Julie Davis, 727 Lakewood Road, Arlington WA 98223. (425) 308-4456. E-mail: clearvallleyfarm@hotmail.com;",
	"website": " www.clearvalleyfarm.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Arlington",
		"state": "Washington",
		"coordinates": [
			122.24059199999999,
			48.157008,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86734"
	},
	"name": "Colvin Ranch",
	"description": "The Colvin Ranch, located in Western              Washington, was homesteaded by the Colvin family over 150 years              ago. We are committed to keeping the ranch in family while providing              nutritious grass fed and grass finished beef for the local              community.                             Our cattle are born and raised on the ranch so you can be confident              of their humane care and healthy living conditions. We use managed              intensive grazing programs that not only ensure the health of the              animals, but the health of the land, water and native plants. The              sustainable care of the land and animals is important to us, to              our customers, and to the community.                             We sell our beef by the half              or quarter, and we are now able to offer our Beef by the Box. This              Box contains about 25-30 pounds of various cuts of steaks and roasts              as well as ground              meat and stew meat. Delivery can be arranged in the Olympia and              Tacoma areas.                            Please contact us if you are interested in buying your beef supply.              Colvin Ranch, 16816               Old Hiway 99 SE, Tenino WA 98589 (http://maps.google.com/maps?oi=map\u0026q=16816+Old+Hiway+99+Se,+Tenino,+WA+98589). (360) 264-2890. E-mail: fred@colvinranch.com",
	"Website": " http://www.colvinranch.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Tenino",
		"state": "Washington",
		"coordinates": [
			122.90000700000002,
			46.841198,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86735"
	},
	"name": "Crea Ranch Beefalo",
	"description": "Crea Ranch Beefalo produces sustainably and humanely raised grass fed and finished Beefalo right here in Eastern Washington. We take great pride in raising our livestock as naturally and as sustainable as possible, and are dedicated to providing our animals the best care possible. All of our Beefalo are grass raised, as nature intended, on our ranch from birth to your table. No added antibiotics, grain, animal bi-products, silage, hormones or growth stimulants have been given to our Beefalo. What is Beefalo meat and why eat it?  Beefalo is a cross between domestic cows and the North American bison. While it is as tender and tasty as beef, Beefalo offers many benefits for the health-conscious consumer. Buffalo meat is often favored for its leanness, and grass-fed beef has nutritional necessities like CLA and Omega-3 fats. Well, grass-fed beefalo might just be the best of both worlds: USDA tests prove that Beefalo has less cholesterol than chicken and less fat, cholesterol, and calories than traditional beef. Beefalo even meets the dietary recommendations of the American Heart Association, so consumers enjoy all the taste of beef with added health benefits. In addition, it is the only red meat shown to lower LDL. We sell our beefalo directly to the consumer by the quarter, half, or whole each fall and have sampler boxes and burger boxes available throughout the year.  Crea Ranch Beefalo,Dana Camarena, P.O. Box 4208, West Richland, WA 99353. (509) 531-7233. E-mail: dcrea@hotmail.com",
	"website": " www.crearanch.com",
	"products": [
		"Buffalo"
	],
	"location": {
		"city": "West Richland",
		"state": "Washington",
		"coordinates": [
			119.36140920000003,
			46.30430150000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86736"
	},
	"name": "Crooked River Bison Ranch",
	"description": "Crooked River Bison Ranch is located in the foothills of the Ochoco National Forest southeast of Prineville, Oregon. Our ranch consists of open pastures and rangeland, with an abundance of clean water and native grasses for our bison to thrive on. We practice intensive grazing methods on our ranch. Our bison are regularly and systematically moved from pasture to pasture. This allows the pastures to recover quicker, provides the bison with young, tender grass and reduces the need for parasite control. Raising our bison with respect and as humanely as possible is important to us. We never give our bison steroids, growth hormones, or antibiotics. Our bison are not confined to small pens or feedlot-like conditions. They are 100% grass-fed throughout the entire course of their lives. Not only is this good for our bison, but it™s also what gives our bison its great taste. When it comes time to harvest, we only field harvest in small numbers to maintain a low stress environment. We chose to field harvest because it yields a superior product. Since bison are undomesticated animals, they generally become easily stressed and agitated under traditional harvest methods. The extra care we put into our ranching practices ensures that the meat on your dinner plate is of the highest quality. We adhere to our strictly-defined ranching standards and practice the most ethical ranching methods so you and your family can enjoy the tastiest, most flavorful bison meat available. Our bison meat is available in quarters, halves and whole animal shares. We also carry ground meat, steaks, roasts, and broth bones. You may contact us via phone, email, website, or Facebook for purchases and arrange a pick up. Delivery and shipping available with additional charges. Crooked River Bison Ranch, Erik Monge, 14042 SE Paulina Hwy, Prineville, OR 97754. (541) 903-2861. E-mail: erik@crookedriverbison.com",
	"website": " http://www.crookedriverbison.com/",
	"products": "Bison",
	"location": {
		"city": "Prineville",
		"state": "Oregon",
		"coordinates": [
			120.66789199999998,
			44.2510959,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86737"
	},
	"name": "Crown S Ranch",
	"description": "Crown S               Ranch is located in the majestic Methow Valley in the foothills               of the North Cascade Mountains. It is one of the most pristine ecosystems               left in America, just outside the tiny town of Winthrop, Washington.               With 50 acres of lush pastureland that for the last 36 years has               never been treated by pesticides or chemicals, it is the perfect               environment for raising happy, healthy, grass-fed beef and               pastured pigs, chickens and turkeys.              The Sukovaty family strives to provide meat               products raised as nature intended: Without hormones, steroids,               GMO feeds. Our cattle are raised with an abundance of lush green               grass on a dozen plus rotated pastures, with plenty of clean water,               sunshine and fresh air.              We are proud of the high quality products we               are able to provide our customers. Our farming practices are sustainable,               our beef is entirely grass-fed and our other livestock is supplied               as much pasture as they will eat and supplemented with organically               certified feed. We go to the extra trouble of raising our animals               in this way because it is better for them, better for the environment               and better for you.              We sell our beef as custom exempt by the quarter.               We can assist with custom slaughter arrangements and delivery requirements.               Come see our web page for more information. See our webpage or contact               us for purchase of pork, chicken and turkeys.              Crown S Ranch, Louis Sukovaty and Jennifer                    Argraves, Box 309, Winthrop                    WA 98862 (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=Winthrop%20WA%2098862). (509) 341-4144.         E-mail: crownsranch@gmail.com",
	"website": " http://www.crown-s-ranch.com (http://www.crown-s-ranch.com) Facebook: Crown S Ranch (https://www.facebook.com/pages/Crown-S-Ranch/125725147445581)",
	"products": [
		"Beef",
		"Pork",
		"Chicken",
		"Turkey"
	],
	"location": {
		"city": "Winthrop",
		"state": "Washington",
		"coordinates": [
			120.17757000000002,
			48.47372,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86738"
	},
	"name": "Dandy Chicken",
	"description": "Dandy Chicken chickens are raised                outside, on a small farm in Whatcom County, near the town of                Lynden. They grow naturally on a diet of fresh air and fresh                water while scratching and eating grass and clover. Their diet                is supplemented by organic feed, however not certified. They                are not fed antibiotics or hormones.                                 With DandyChicken.com you                are getting flavorful chicken that is guaranteed to be humanely                raised. We are pleased to offer the Colored Free Range chicken.                These are derived from the American and European old heritage                breed of chicken and were developed in the early 1960™s                to meet the highest standards of the French Free Range program.                  Birds can be pre-ordered from our website.                Limited number of Heritage turkeys available in season.                 Dandy Chicken, Chad Baron, 631                  H Street Road, Lynden WA  98264 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=631+H+Street+Road,+Lynden+WA%C2%A098264\u0026sll=37.0625,-95.677068\u0026sspn=52.285401,83.847656\u0026ie=UTF8\u0026ll=48.994636,-122.519531\u0026spn=5.47149,10.480957\u0026z=7\u0026iwloc=A). (360) 303-8996. E-mail: info@dandychicken.com (mailto:info@dandychicken.com).               ",
	"website": " http://www.dandychicken.com",
	"products": [
		"Turkey",
		"Chicken"
	],
	"location": {
		"city": "Lynden",
		"state": "Washington",
		"coordinates": [
			122.514167,
			48.993349,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86739"
	},
	"name": "Dee Creek Farm",
	"description": "Woodland, WA.  Beef, pork, lamb, turkey, chicken, eggs, raw milk, cheeses, lacto-fermented \u0026 fresh veggies, and more.               Dee Creek Farm is a multi-generational farm              that offers a diversity of foods straight from the farm, all pastured,              with no hormones, antibiotics or other chemicals included: beef,              pork, lamb, turkey, chicken, eggs, raw milk, cheeses, lacto-fermented              and fresh              veggies, jams \u0026 butters, kombucha \u0026 kefir              scoby's,              fleece, natural skin care \u0026 non-toxic household cleaners, and            more!                          Our goal is to build an ecologically self-sustaining              farm, using natural methods and humane practices. We are pleased              to offer our quality products and services to those who desire            an alternative for a more healthy lifestyle.                          We do weekly deliveries              to the Vancouver area in our Mobile Farm Store. You will find other              local farmers™ goods              from time to time. Things like dried herbs, raw honey, organic            bread, etc¦                             We also host a variety of workshops at the              farm to keep people actively learning, and to stay connected to              the farm. We encourage folks to come out and see our multi-licensed              farm, all things micro: the dairy parlor, meat processing facility,              commercial kitchen \u0026 egg handling. Other learning adventures            include: CSA gardens, wild foraging, and animal husbandry.                          Please              visit our website or email for more information!             Dee Creek Farm, 2402                Little Kalama River Road, Woodland WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026time=\u0026date=\u0026ttype=\u0026q=2402+Little+Kalama+River+Road,+Woodland+WA\u0026sll=37.0625,-95.677068\u0026sspn=42.495706,58.095703\u0026ie=UTF8\u0026ll=45.981695,-122.67334\u0026spn=9.359022,14.523926\u0026z=6\u0026iwloc=addr\u0026om=0) 98674. (360) 225-9711. E-mail: info@deecreekfarm.com (mailto:info@deecreekfarm.com).                          ",
	"website": " http://www.deecreekfarm.com",
	"products": [
		"Beef",
		"pork",
		"lamb",
		"turkey",
		"chicken",
		"eggs",
		"raw milk",
		"cheese"
	],
	"location": {
		"city": "Woodland",
		"state": "Washington",
		"coordinates": [
			122.668874,
			45.988658,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673a"
	},
	"name": "Dirty Boots Ranch",
	"description": "Dirty  Boots Ranch, located 30 minutes North of Spokane, provides grass-fed Berkshire pigs and Finnsheep lamb. All are raised using organic practices but we  are not certified.        Our  Berkshire pigs come from premier Iowa stock and consistently produce healthy  piglets. Our boars and sows live on the Ranch with their piglets. They are pasture and woodland raised and receive  non-GMO feed. We occasionally have breeder stock  available.        The  Finnsheep are grass fed and receive hay that we produce at the Ranch. They live with their guardian Alpacas and Great Pyrenees  dog named Freya.         Our animals are  reared without antibiotics or hormones, live outdoors with shelters during  inclement weather, and are allowed to have the most natural lives  possible.         We are a  family farm and a portion of the proceeds go to our children's college  funds. Meat is sold in halves and whole. Delivery to Seattle area  possible. Please visit our website or contact Amy directly at  (509) 238.5187.         Dirty  Boots Ranch,  Amy and Kurt Monsen, 27912 N Elk Chattaroy Road, Chattaroy, WA 9900 (https://www.google.com/maps?q=27912+N+Elk+Chattaroy+Road,+Chattaroy,+WA+9900\u0026hl=en\u0026ll=47.546872,-119.443359\u0026spn=4.575354,10.316162\u0026sll=37.0625,-95.677068\u0026sspn=42.766543,82.529297\u0026hnear=27912+N+Elk+Chattaroy+Rd,+Chattaroy,+Washington+99003\u0026t=m\u0026z=7)3. (509) 238.5187.          E-mail: amonsen@hotmail.com          ",
	"website": " www.dirtybootsranch.com (http://www.dirtybootsranch.com)",
	"products": [
		"Pork",
		"Lamb"
	],
	"location": {
		"city": "Chattaroy",
		"state": "Washington",
		"coordinates": [
			117.267791,
			47.909338,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673b"
	},
	"name": "Douglas Farms",
	"description": "Douglas Farms is a family farm located outside              Yakima in Central Washington. We raise grassfed cattle and sheep,            and grainfed pigs supplemented with pasture. We do not use any hormones,            routine antibiotics, or artificial feed ingredients.                          Being environmentally responsible is important              to us; we know we share this world with others and it would be              short sighted to do otherwise. We especially appreciate the health              benefits associated with eating grass fed meat and are blessed            to be able to supply this to others.                          Grassfed beef is available in whole, halves,              or split halves. Lamb and pork is sold as whole or halves. The              meat is cut and wrapped locally according to personal preference.              It is generally available May through November, but we take orders            year-round.                          Please contact us with questions or if you            are interested in our grassfed beef, lamb, or pork.                          Douglas Farms, Nate and Tabi Douglas, 261                      W Taylor Road, Selah WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=261+W+Taylor+Road,+Selah+WA\u0026sll=37.0625,-95.677068\u0026sspn=43.578243,72.333984\u0026ie=UTF8\u0026ll=46.687131,-120.563965\u0026spn=4.740246,9.041748\u0026z=7) 98942. (509) 698-6393. E-mail: ntdouglas@fai",
	"website": " http [://www.douglasfarms.org.",
	"products": [
		"Beef",
		"Lamb",
		"Pork"
	],
	"location": {
		"city": "Selah",
		"state": "Washington",
		"coordinates": [
			120.56262200000002,
			46.68763,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673c"
	},
	"name": "Earth Cycle Farm",
	"description": "Earth              Cycle Farm is committed to the sustainability of the ecosystem              and its communities. We maintain grazing rotations that improve              the health of the land while preventing soil erosion from wind              and water. Our very lean beef is raised only on our own certified              organic fields and pastures.               Our cattle move from one lush pasture              to the next throughout the growing season, and then eat our organic              grass and alfalfa hay during the winter. They are not \"fattened-up\" with              large amounts of grain or feed supplements. Rather than depend              on additives and medicines, we rely on prime pastures and plenty              of fresh air and sunshine to keep them healthy. Most of our butchering              is done in summer and fall, when the cattle are on green pastures.              The result is a lean, flavorful meat with minimal fat and no chemical              additives.              Your satisfaction is our goal, so we back up              our beef with a money-back guarantee. Seth Williams at (509) 236-2402,              offers custom cut and wrap on a fourth, half, or whole beef. Quadra-k              Meats, a few minutes from downtown Spokane, does a great job preparing              your beef. They are very busy, so please call us early to schedule              your order. After butchering, you beef is aged about a week, then              cut, wrapped and frozen. You can pick it up the following day.              Remember to bring some boxes or coolers to save money and cardboard.                           Ground beef, milk, farmers                cheese, and other              Earthcycle farm products are available year round to Earthcycle              food club members. Earth Cycle Farm Celtic-Cross heifers and cows              are a specialty breed that produces high-quality pasture-finished              beef high in Omega-3s.              For more information, please visit our websites              or call us at the number below.              Earth              Cycle Farm, Huw Williams, 52721              Sobek Road East, Edwall, WA (http://www.google.com/maps?q=52721+Sobek+Rd+E,+Edwall,+WA+99008,+USA\u0026ie=UTF8\u0026ll=47.535747,-117.872314\u0026spn=2.592263,6.410522\u0026z=8\u0026iwloc=addr\u0026om=1) 99008.              (509) 236-2265. or learn more about us at               http://earthcycle.wordpress.com (http://earthcycle.wordpress.com/) or http://360.yahoo.com/julialuvsearth.",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Edwall",
		"state": "Washington",
		"coordinates": [
			117.84453999999998,
			47.540301,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673d"
	},
	"name": "Evergreen Students for Sustainable Animal Agriculture",
	"description": "Evergreen Students for Sustainable                      Animal Agriculture raises ewes and lambs that                      are on grass pasture their whole lives. We manage our pastures                      with intense rotational grazing and supplement with locally                      grown grass silage when needed.          The flock is managed by Students from the Evergreen        State College who are interested in animal agriculture. This educational        opportunity and sharing of animal husbandry knowledge is critical to        the sustainability of agriculture.         Animal welfare is our top priority. We emphasize        stress free handling and do not dock tails. We use preventative health        care management to minimize disease.        Details for ordering and additional information        can be found on our website. Please feel free to e-mail us with any questions        about our operation, our e-mail address can be found on our website.        Evergreen Students for Sustainable Agriculture, Mike        Paros, 9222        Lundeen Road SW, Centralia WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=9222+Lundeen+Road+SW,+Centralia+WA\u0026sll=37.0625,-95.677068\u0026sspn=45.822921,60.029297\u0026ie=UTF8\u0026ll=46.769968,-123.09082\u0026spn=19.936923,30.014648\u0026z=5\u0026iwloc=addr) 98531.          E-mail: essapasturedlamb@gmail.com (mailto:essapasturedlamb@gmail.com).       ",
	"website": " http://www.localharvest.org/blog/21778/",
	"products": "Lamb",
	"location": {
		"city": "Centralia",
		"state": "Washington",
		"coordinates": [
			123.076576,
			46.780941,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673e"
	},
	"name": "The Faded Rose Ranch",
	"description": "The Faded Rose Ranch is          located on Puget Island, on the banks of the Columbia River, across          the bridge from Cathlamet, WA and accessible via ferry from Westport,          OR. The ranch is within a scenic drive from both Seattle, WA and Portland,          OR areas. This one-man and two-dog sheep and cattle          operation offers all-natural, grass-fed freezer lamb and beef by          the whole or half.        All animals are bred, born, and raised here. Grass/hay,        clean water, plus mother™s milk make up the diet of our livestock.        Our happy animals are raised in a stress-free and humane environment.        We are not certified organic but we try.  No hormones, supplements        or antibiotics are ever used.        The delicate flavored lamb of a        Katahdin hair heritage breed ewe will be a welcome addition to your diet.        We look forward to telling you why. Our beef comes        from Irish Dexter cows usually crossed with Black Angus to give the finest        flavor and a size that will fit in your freezer. Delivery to a local        butcher is included in the sale. Delivery to your location may be possible.          Product is available in the fall and can be made available other times        of year if prior arrangements are made. It does help the shepherd's        planning if indications of product interest could be made as far as possible        in advance of your need.                Come visit, bring a kayak and enjoy the river.        We are proud of how we raise our animals and we are proud of the quality,        taste and safety of our products.        We look forward to feeding you soon!        The Faded Rose, Mike McAvoy, 130          E Little Island Road, PO Box 313, Cathlamet WA  (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=130+E+Little+Island+Road,+Cathlamet+WA%C2%A0\u0026sll=37.0625,-95.677068\u0026sspn=47.838189,72.949219\u0026ie=UTF8\u0026hq=\u0026hnear=130+E+Little+Island+Rd,+Cathlamet,+Wahkiakum,+Washington+98612\u0026ll=46.182815,-123.366141\u0026spn=2.631826,4.559326\u0026z=8) 98612. (360) 849-0030.         ",
	"website": "        http://www.localharvest.org/the-faded-rose-M17521",
	"products": [
		"Beef",
		"Lamb"
	],
	"location": {
		"city": "Cathlamet",
		"state": "Washington",
		"coordinates": [
			123.366141,
			46.182815,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8673f"
	},
	"name": "Farmer Ben's",
	"description": "Farmer Ben's is a family farm, farming the way our grandparents did. Our children are the 6th generation of farmers in our family. We are located in Lynden Washington, just about 2 hours north of Seattle and 7 miles south of the Canadian Border. We raise 100% grass fed Black Angus. Our beef is not just \"beef\" or \"grass fed.\"  We have outstanding genetics in our cattle. We AI breed some of our registered cattle and we have an amazing registered black Angus herd bull that has fabulous blood lines. Some of the things we breed for are carcass quality, marbling and calving ease. Our fields are pesticide-free! We only put our manure on the fields for nutrients.  We raise registered Berkshire pigs. These pigs have the life! They are out on pasture year round and have the opportunity to come in the barn whenever they please. In the summer they all have sprinklers to help keep them cool! We have worked with a local grain company to come up with a soy- and corn-free grain blend just for our pigs.   We also raise a few meat birds in the spring. We raise these in chicken tractors on the pasture. They are moved daily to fresh grass. They are fed a certified organic grain that is soy- and corn-free.   We are not certified organic. We farm using organic practices. We do not use commercial fertilizers or pesticides.   We sell our products off our farm. We have everything butchered USDA and sell individual cuts of frozen meat. We also offer halves and wholes of our beef and pork.   We suggest that you check out our facebook page for updates on our meat supply or call the farm and listen to the answering machine before heading out.   Please visit our website for more information on us, our farm, our animals, and other products that we make right here on the farm.  Our store hours are Fridays and Saturdays 10 to 5. Our meats will also be available through Sound Harvest Delivery (http://www.soundharvestdelivery.com) starting in October 2013. \"Facebook page:\" Farmer Ben's. \"You Tube:\" Farmer Ben's Berkshires.  Please email us with any questions!   Farmer Ben's, Ben or Jessica Elenbaas, 1461 VanDyk Road, Lynden WA (https://www.google.com/maps?q=1461+VanDyk+Road,+Lynden+WA\u0026hl=en\u0026ll=48.538432,-122.159729\u0026spn=1.163884,2.650452\u0026sll=37.0625,-95.677068\u0026sspn=44.339735,84.814453\u0026hnear=1461+Van+Dyk+Rd,+Lynden,+Washington+98264\u0026t=m\u0026z=9) 98264. (360) 354-8812. E-mail: info@myfarmerben.com",
	"products": [
		"Beef",
		"Pork",
		"Chicken"
	],
	"location": {
		"city": "Lynden",
		"state": "Washington",
		"coordinates": [
			122.41205000000001,
			48.913254,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86740"
	},
	"name": "Forest Cattle Company - Sedro Woolley",
	"description": "Forest Cattle is a family owned and operated        ranch started in 1981 in the Snohomish River Valley. For almost 30 years        we have raised our own herd of 100% grass fed/grass finished Red Angus        beef cattle. We strive to provide you with only the highest quality beef        for your table.        Forest Cattle Company uses only the best organic        and environmentally friendly practices. Our cattle never receive antibiotics        or hormones and each animal is individually tagged and tracked to ensure        the health of the animal and the herd. The cattle are humanely raised,        free to roam and graze on our sustainable pasture rotation system. This        ensures the cattle ingest the most lush and nutrient rich grasses available,        for a stress-free and healthy lifestyle. We believe \"Nature's        Way is Best\": better for the cattle, better for the environment,        and better for you and your family.        Our old style dry aged Red Angus beef is sold by        the quarter, half or whole animal. Due to high demand we have expanded        our ranching operation to the Snoqualmie Valley near Duvall and Skagit        County near Sedro Woolley. We strive to have beef available year-round,        however we recommend ordering as far in advance as possible to insure        timely delivery. We have ground beef in 1-pound packages and boxes        of ground beef patties for sale as well.        Our goal is to produce beef of the highest quality,        that we would be proud to serve to our own family and friends. We would        enjoy nothing more than to share the best beef available with        you at an affordable cost. From our family to yours.        We look forward to hearing from you and answering        any questions you may have. Please check us out at our website. Thank        you for supporting your local ranching families.        Forest Cattle Company, David Steele, PO Box 1083,        Snohomish        WA (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=Snohomish+WA\u0026sll=37.0625,-95.677068\u0026sspn=48.374125,79.013672\u0026ie=UTF8\u0026hq=\u0026hnear=Snohomish,+Washington\u0026ll=47.912876,-122.098185\u0026spn=1.288658,2.469177\u0026z=9)  98290. (425) 359-0594.          E-mail: forestcattle@hotmail.com (mailto:forestcattle@hotmail.com).        ",
	"website": " http://www.forestcattle.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Sedro-Woolley",
		"state": "Washington",
		"coordinates": [
			122.23611,
			48.50389,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86741"
	},
	"name": "Forest Cattle Company - Snohomish",
	"description": "Forest Cattle is a family owned and operated        ranch started in 1981 in the Snohomish River Valley. For almost 30 years        we have raised our own herd of 100% grass fed/grass finished Red Angus        beef cattle. We strive to provide you with only the highest quality beef        for your table.        Forest Cattle Co. uses only the best organic and        environmentally friendly practices. Our cattle never receive antibiotics        or hormones and each animal is individually tagged and tracked to ensure        the health of the animal and the herd. The cattle are humanely raised,        free to roam and graze on our sustainable pasture rotation system. This        ensures the cattle ingest the most lush and nutrient rich grasses available,        for a stress-free and healthy lifestyle. We believe \"Nature's        Way is Best\": better for the cattle, better for the environment,        and better for you and your family.         Our old style dry aged Red Angus beef is sold by        the quarter, half or whole animal. Due to high demand we have expanded        our ranching operation to the Snoqualmie Valley near Duvall and Skagit        County near Sedro Woolley. We strive to have beef available year-round,        however we recommend ordering as far in advance as possible to insure        timely delivery. We have ground beef in 1-pound packages and boxes        of ground beef patties for sale as well.         Our goal is to produce beef of the highest quality,        that we would be proud to serve to our own family and friends. We would        enjoy nothing more than to share the best beef available with        you at an affordable cost. From our family to yours.         We look forward to hearing from you and answering        any questions you may have. Please check us out at our website. Thank        you for supporting your local ranching families.         Forest Cattle Company, David Steele, PO Box 1083,        Snohomish        WA (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=Snohomish+WA\u0026sll=37.0625,-95.677068\u0026sspn=48.374125,79.013672\u0026ie=UTF8\u0026hq=\u0026hnear=Snohomish,+Washington\u0026ll=47.912876,-122.098185\u0026spn=1.288658,2.469177\u0026z=9)  98290. (425) 359-0594.          E-mail: forestcattle@hotmail.com (mailto:forestcattle@hotmail.com).        ",
	"website": " http://www.forestcattle.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Snohomish",
		"state": "Washington",
		"coordinates": [
			122.09818500000002,
			47.912876,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86742"
	},
	"name": "Fraction Farm",
	"description": "Fraction Farm produces organic (not certified)        pasture-raised        chickens.              Poultry is raised on pasture and fed organic feed        free of medications and hormones. In addition to chickens, limited        numbers of other poultry are available.             You must        call or email (email is best) to reserve your chickens on our next processing        date. All chickens must be picked up from the farm within 48 hours        of processing. Please email for availability.               Visit        our website for details on processing dates as well as other farm fresh        products available.        Fraction Farm, Inger Owen, 33117 36th Avenue E, Eatonville        WA  (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=Eatonville+WA+\u0026sll=37.0625,-95.677068\u0026sspn=41.818029,58.886719\u0026ie=UTF8\u0026hq=\u0026hnear=Eatonville,+Pierce,+Washington\u0026ll=46.867326,-122.266502\u0026spn=0.566151,0.920105\u0026z=10)98328. (253) 380-3803.  E-mail: inger@fractionfarm.com (mailto:inger@fractionfarm.com).",
	"website": "        http://www.fractionfarm.com",
	"products": [
		"Chicken"
	],
	"location": {
		"city": "Eatonville",
		"state": "Washington",
		"coordinates": [
			122.26650200000002,
			46.867326,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86743"
	},
	"name": "Grass Fed Beef “ J. Hutton",
	"description": "Grass Fed Beef “ J. Hutton is a fourth generation beef operation  on the southeast side of the Cascade Mountains in Washington State. Joann        started in the business at 6 years of age with her first calf, raised        market steers for her 4-H project for 9 years and still has some of the        same blood line in present herd.        The operation has been managed holistically          for sustainability since 2000. The cattle are raised from gestation          to harvest, for quality control of the product. The cattle are raised          on rotational pastures (thus always going on mature, new pastures every          4 to 10 days) and fed hay during the winter months. The cattle are          always treated with respect and love.         The cattle are Horned Herefords, with a few          crossed with Shorthorn and Angus. Joann keeps only her own heifers        for replacements and buys only the bull. This way Joann knows        the cattle have never been        fed grains, given hormones or growth-promoting additives, pesticides,        antibiotics, or any other drugs. Grass Fed Beef “ J. Hutton is        Animal Welfare Approved.         Grass Fed Beef “ J. Hutton,  Ellensburg        WA 98926 (http://g.co/maps/9hgzm). (509) 968-4610.        E-mail: johutton1@fai",
	"website": " http [://www.grassfed.us.",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Ellensburg",
		"state": "Washington",
		"coordinates": [
			120.54784700000002,
			46.996514,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86744"
	},
	"name": "GrassKickin'  Farms",
	"description": "GrassKickin'  Farms grows and sells Beef, Pork, and Poultry using management intensive  rotational grazing techniques along with Joel Salatin-style, poly-culture  pasture-based farming methods. Although  we are not yet certified organic, we practice organic farmland management. We are passionate about growing high quality PasturePickin' Protein!                  ¢  Beef “ 100% Grass Fed \u0026 Grass Finished...w/ High Quality Black \u0026 Red Angus                ¢  Pork “ Grassy Woodland Rootin'...w/ Pure Berkshire (Chef's Choice)          ¢  Chicken “ Pasture Pickin'..w/ Red Ranger \u0026 White Heritage         ¢  Turkey “ Grass Gobblin'...w/ Broad Breasted Bronze         ¢  Eggs “ Free Rangin'...w/ Assortment of Heritage Hen Breeds        GrassKickin'  Farms is owned by the McGuffin family of five, and as a family we are  constantly learning the art of pasture-based farming together as a work in  progress.  We farm on 50 acres located in Camas, WA near the Columbia  River and Portland, OR...just 15 minutes from PDX.         As a  fit farmin' family, we subscribe to the Paleo / Primal diet of High Quality  PasturePickin' Protein, and the Westin Price teachings of  the nutritional benefits of eating the Whole Animal...and many of our  GK customers do, too!        Visit our website to see:       ¢  GrassKickin' Mixed Bundles (10“20 lbs) of       Beef, Pork and Poultry...usually 1“2 grocery bags.                 ¢  GrassKickin' Spice Packs made from High       Quality Spices for Special Seasonings, Brines \u0026 Rubs... w/o fillers,       sugars, gluten, nitrates, etc.                          All of our GK Beef and Pork is processed       at an Animal Welfare Approved USDA Inspected abattoir. All of our GK Poultry is processed       humanely at a state-inspected (USDA Exempt) poultry abattoir.                GK Customers can pickup from the farm,       or we offer Free Delivery direct to you locally and have drop       locations.        GK Customers typically order Bundles every 3“6 weeks.       We can ship with dry ice for special orders.                   Check out our website for  current pricing and availability. We are also at the Camas Farmers Market on Wednesdays from 3-7pm, June 13“October 10, 2013.        GrassKickin' Farms, Shane and Melissa McGuffin, 24108 NE Weakly Road, Camas WA (https://www.google.com/maps?q=24108+NE+Weakly+Road,+Camas+WA\u0026hl=en\u0026ll=45.639007,-122.423401\u0026spn=1.311575,2.688904\u0026sll=37.0625,-95.677068\u0026sspn=47.215051,86.044922\u0026hnear=24108+NE+Weakly+Rd,+Camas,+Clark,+Washington+98607\u0026t=m\u0026z=9) 98607. (360) 600-8854.         E-mail: gomeat@grasskickin.com",
	"website": " http://www.grasskickin.com",
	"products": [
		"Beef",
		"Prok",
		"Chicken",
		"Turkey",
		"Eggs"
	],
	"location": {
		"city": "Camas",
		"state": "Washington",
		"coordinates": [
			122.425053,
			45.638718,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86745"
	},
	"name": "Greener Pastures Farm",
	"description": "Greener               Pastures Farm is an organically managed small farm raising               primitive breeds of sheep. We are focusing primarily on American               Soays and English Soays, but also keep a few Shetlands. These breeds               are naturally lean and taste like elk. Our sheep are always on pasture;               never confined to a pen, with the exception of the first few days               after lambing while babies bond with their dam. Our sheep do not               receive grains; only grass hay and alfalfa hay when pasture growth               has slowed.               Soay sheep are the most primitive breed of domesticated               sheep, originating thousands of years ago on a tiny island 110 miles               west of Scotland, so it's not surprising that their meat does not               have that domestic \"muttony\" flavor, even at 3 or more               years of age. We sell freezer lambs only at certain times of the               year, so please call to reserve yours. We also provide breeding               stock of the highest quality. Visit our informative website, or               call us. We enjoy sharing information about these sheep!              Greener Pastures Farm, Ronda Jemtegaard and               Jon Schulze, Camas               WA (http://www.mapquest.com/maps/map.adp?country=US\u0026address=\u0026city=Camas\u0026state=WA\u0026zipcode=98607)  98607. (360) 833-1917. E-mail:soayshepherdess@aol.com (mailto:soayshepherdess@aol.com)                              ",
	"website": " http://www.greenerpasturesfarm.com",
	"products": [
		"Sheep"
	],
	"location": {
		"city": "Camas",
		"state": "Washington",
		"coordinates": [
			122.40197999999998,
			45.58688,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86746"
	},
	"name": "Hallet Family Farm",
	"description": "Hallet Family Farm Label Rosa Pastured Broilers.  We raise our broilers on pasture and with access to feed that is GMO-free by Farmer™s  Promise, Soy-Free, and Corn-Free, and grown and manufactured locally by our  partner and friends at Patriot Farm and Bison in the South Puget Sound region.  Our feed is formulated for the best possible omnivorous poultry diet, with  organic fish meal as the primary source of protein. We also include therapeutic  levels of Diatomaceous Earth, Kelp Meal, and other natural vitamin and mineral  sources that are beneficial to chicken health and a better, healthier, and more  flavorful product for our customers.                   Hallet Family Farm also ensures that our animals are given the best possible  life, raised on a farm which follows Sustainability and Organic practices,  though we are not certified. We are a new family farm, just starting to offer  products to the Greater Seattle Area. Our chickens are available for presale  for on-farm pickup only. Please contact us for an order form and to reserve  your chickens.             Hallet Family Farm will also be  adding Turkeys, our own beef, grown here at the farm, and forest-finished pork in the near future. Please contact us for more information.        Hallet Family Farm, Joel and Loralei Hallet, 39805 212th Avenue SE, Enumclclaw, WA (https://www.google.com/maps?q=39805+212th+Ave+SE,+Enumclaw,+King,+Washington+98022\u0026hl=en\u0026ll=47.245678,-122.058105\u0026spn=2.670054,6.366577\u0026sll=37.0625,-95.677068\u0026sspn=49.444078,101.865234\u0026geocode=Fc7k0AIdFoW5-A\u0026hnear=39805+212th+Ave+SE,+Enumclaw,+King,+Washington+98022\u0026t=m\u0026z=8) 98022. (206) 484-4369 or (360) 625-0035.        E-mail: halletfamilyfarm@gmail.com",
	"website": " http://www.halletfamilyfarm.com Facebook: http://www.facebook.com/halletfamilyfarm",
	"products": [
		"Chicken",
		"Beef",
		"Turkey"
	],
	"location": {
		"city": "Enumclaw",
		"state": "Washington",
		"coordinates": [
			122.05949800000002,
			47.244494,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86747"
	},
	"name": "Happy Hollow Farm",
	"description": "Happy Hollow Farm is a second generation              farm located on the foothills overlooking the Stillaguamish Valley,              one hour's drive north of Seattle.               Our beef is born and              raised in a non-stress environment on our 80 acres of grassland.              The calves spend their first year of life at their mothers' sides.             Our animals are fed no hormones, grain or antibiotics.              Supplemental winter feed is grass hay harvested from our farm or              the Silvana community. They are placed on lush grass at the end              of the winter, rotated among our pastures throughout the summer,              and  are ready to butcher in the fall.              We sells quarters, halves or whole packages,              and also have lean ground beef available in one pound packages.              The meat will be cut to your specifications by Silvana Meats in              Silvana, WA.              Call              for current prices and to reserve your order.              We are committed to sustainable farm practices,              environmental responsibility, caring animal welfare, and maintaining              foods grown on our farm, including fruits, vegetables, chickens,              apple cider, etc.  We sell grass hay harvested from our farm              and also offer wagon and carriage rides with our team of Belgian              horses for weddings, parties, and events.             Happy Hollow Farm, Mark Winterhalter and Cathy              Nelson, 21729              50th Avenue NW, Stanwood WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=21729+50th+Avenue+NW,+Stanwood+WA\u0026sll=37.0625,-95.677068\u0026sspn=46.092115,60.292969\u0026ie=UTF8\u0026ll=48.191726,-122.294312\u0026spn=2.438914,3.768311\u0026z=8\u0026iwloc=addr). (360) 652-9132.                E-mail:              cvnride@verizon.net (mailto:happyhollowbeef@gmail.com).",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Stanwood",
		"state": "Washington",
		"coordinates": [
			122.29695,
			48.192811,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86748"
	},
	"name": "Hardgrass Beef",
	"description": "Hardgrass Beef is our family's  farm in Lostine, Oregon. Providing families 100% Grass fed, Nutrient Rich,  Dry-Aged, Scottish Highland Beef. Free-Shipping to lower 48 states.  Our cattle graze Organic Certified Land (Oregon Tilth). Our farming  philosophy is simple: Combine the best breed of cattle with the optimal  environment and stewardship of the land, followed with humane care and respect  for the animals to create the best nutrient rich beef from our family to yours!                - 100%       Grassfed, Organic Certified Pastures (Oregon Tilth), Lean         - No       Antibiotics, No Herbicides, No Pesticides, No Hormones         - High       in Omega-3 fatty acids and CLA's         - USDA       small scale Artisan Butcher          - Stewardship       of our riparian areas and upland grasses through rotational grazing       practices and protective fencing              Purchase our meat  online. All meat is USDA inspected. All meat is humanely harvested,  dry-aged, artisan butchered then flash frozen and cryo-vacuumed packaged. We offer our beef for sale as ground beef, premium steaks, quarters,  halves and whole beef options.                To purchase our meat or  learn more about our family farm please visit our website or give a call.         Hardgrass Beef, LLC., Getty Pollard, 69602 Warnock Road, Lostine OR (https://www.google.com/maps?q=69602+Warnock+Road,+Lostine+OR\u0026hl=en\u0026ll=45.521744,-117.443848\u0026spn=9.928754,20.632324\u0026sll=37.0625,-95.677068\u0026sspn=44.658568,82.529297\u0026hnear=69602+Warnock+Rd,+Lostine,+Oregon+97857\u0026t=m\u0026z=6) 97857. (541) 263-1545 or (888) 333-9812.         E-mail: info@hardgrassbeef.com",
	"website": " http://www.hardgrassbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Lostine",
		"state": "Oregon",
		"coordinates": [
			117.44991500000002,
			45.527071,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86749"
	},
	"name": "Harlow's Hills West Coast",
	"description": "Harlow's               Hills West Coast (Portland, OR Metro Area) provides locally               grown, grass fed, natural lambs. Our lambs are NEVER fed               grain and are bred to be hearty and healthy on Natural, Native Grass.               You will taste the difference the first time and come back for more.                           We have lambs ready now. Please contact us today               to reserve your lamb.              Harlow's Hills West Coast, Owner/Operator:               Eric JT Harlow, 611               NE Hughes Road, Washougal WA 98671 (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=611%20NE%20Hughes%20Road%2C%20Washougal%20WA%2098671). (360) 837-3606.                E-mail: eric@harlowshillswestcoast.com (mailto:eric@harlowshillswestcoast.com).              ",
	"website": " http://www.harlowshillswestcoast.com",
	"products": "Lamb",
	"location": {
		"city": "Washougal",
		"state": "Washington",
		"coordinates": [
			122.2822,
			45.626248,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674a"
	},
	"name": "Hoh Humm Ranch",
	"description": "Hoh               Humm Ranch has been in my family for three generations. My               grandmother started ranching on the Hoh River in 1913. We have always               raised both cattle and sheep in the same manner on the ranch.              The animals on Hoh Humm are pasture-raised and               are left with their mothers. In the winter, they are fed hay that               we raise ourselves. The cattle are sold in late fall and early winter               while the lambs are sold from summer through late fall. We               sell the beef, custom-cut, freezer-wrapped and delivered               in the Puget Sound area for $5.00 a pound. There is a 50-pound minimum               on the order.              Hoh Humm Ranch, Cici Wilson, 1909 28th Street               SE, Auburn WA  98002. (253) 804-3364.",
	"products": [
		"Beef",
		"Lamb"
	],
	"location": {
		"city": "Auburn",
		"state": "Washington",
		"coordinates": [
			122.20482300000002,
			47.284428,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674b"
	},
	"name": "Holy Cow Natural Grassfed Beef",
	"description": "Holy Cow Grassfed Beef / Moses    Farm is  very proud to be awarded 2012 Farmer of the Year by the Greater Wapato Area Chamber of Commerce. In 2011 we were  awarded Top Animal Welfare Certification by Animal Welfare Approved.  Our animals are free-range and we practice American Grassfed approved  methods on the farm. We are breeders, growers, and USDA    certified organic producers. We are inspected for our health and safety rules. Our endorsements tell you we do it right.  We farm 128 acres of organic grass hay, breeding  over 100 cows and their calves in a closed herd.   The beef we  sell has been bred, born, raised and finished on the highest quality irrigated  organic grass pastures. Holy Cow  is passionate about providing customers  with the healthiest, safest and best quality 100% natural organic grass fed  beef on the planet. We have a high vigor breeding program using two breeds  exclusively:  Angus and Limousin. The result is  known for the excellent marbling and longer loin muscle, resulting in the  highest quality organic grass fed beef.  Beef is available  year-round and can be picked up at the farm in the Lower Yakima Valley  or  we have two low-cost delivery options: 1) we make regular deliveries to pick-up  spots in the Seattle, Portland, and Vancouver metro areas; and  2) we have our own refrigerated truck and can deliver quarters, halves or wholes  to San Francisco and Sacramento in California, or to Portland,  Oregon.  We offer great taste at a great price. Visit the Holy Cow  Grassfed Beef website for order information and to learn more about the  farm.  Holy Cow Natural Grassfed Beef, Janelle Moses,  Wapato  WA   98951. (509) 848-2598 or (509) 985-9457.   E-mail: sales@holycowgrassfed.com ",
	"website": " http://www.holycowgrassfed.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Wapato",
		"state": "Washington",
		"coordinates": [
			120.420338,
			46.447628,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674c"
	},
	"name": "Home Acres Farms",
	"description": "Homeacres Farms raises chickens,                pigs, turkeys              and a small number of lambs on pasture. We                cater to people who want to know where their food comes from.                We sell animals live at the              farm gate, half or whole. We also offer classes            on processing chickens and turkeys several times a year.               Home Acres Farms, Bruce King, 1905                55th Avenue SE, Everett WA  98205 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=1905+55th+Avenue+SE,+Everett+WA+98205\u0026sll=37.0625,-95.677068\u0026sspn=48.50801,79.804688\u0026ie=UTF8\u0026ll=47.978891,-122.156982\u0026spn=1.290685,2.493896\u0026z=9). (206) 940-4980. E-mail: bruceki@bigpig.net.",
	"website": " http://www.ebeyfarm.blogspot.com",
	"products": [
		"Chicken",
		"Turkey",
		"Pork",
		"Lamb"
	],
	"location": {
		"city": "Everett",
		"state": "Washington",
		"coordinates": [
			122.15695600000001,
			47.97881700000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674d"
	},
	"name": "Hope Springs Ranch",
	"description": "Hope Springs Ranch produces naturally raised, grass fed beef.                             Our cattle are born and raised              on the farm so we are able to manage all aspects of their care              and maintain a stress free atmosphere. Our livestock are given              no added hormones, antibiotics,              or animal by products. Our herd knows us as friends and lives a              stress free life.              Your beef will be tender, flavorful and cut              to your specification. Order by the 1/4, 1/2, or whole by              contacting us at one of the numbers below.              Delivery to Skagit,              Snohomish and North King              County can be arranged for              larger orders.              Hope Spring Ranch, Janet \u0026 Kirk Jayne, 8819              182nd St NE, Arlington WA 98223 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=8819+182nd+St+NE,+Arlington+WA+98223\u0026sll=37.0625,-95.677068\u0026sspn=51.310143,67.939453\u0026ie=UTF8\u0026ll=48.162421,-122.113037\u0026spn=2.726122,4.246216\u0026z=8\u0026iwloc=addr). (360) 435-6150. E-mail: hopespringsranch@hotmail.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Arlington",
		"state": "Washington",
		"coordinates": [
			122.111509,
			48.161668,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674e"
	},
	"name": "Lazy R Ranch",
	"description": "Lazy                 R Ranch is a fourth generation beef operation                 that  has been managed holistically since 1996. Holistic management                 is  a goal-driven decision making process that insures that                 decisions  are economically, environmentally, and socially appropriate.                 I use planned grazing, as prescribed by holistic management,                 that puts animals at the right place, at the right time, for                 the right reasons. This allows me to exceed traditional organic                 and sustainable practices and move towards regenerative agriculture.               Our all natural beef is available in halves,               quarters, or whole beef in the late fall or early winter.                Lazy R Ranch, Beth Robinette, S 16102 Wolfe Road, Cheney WA 99004. (509) 990-4247.  E-mail:mlrobinette@gmail.com  (mailto:mlrobinette@gmail.com",
	")Website": " http://www.lazyrbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Cheney",
		"state": "Washington",
		"coordinates": [
			117.709145,
			47.507418,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8674f"
	},
	"name": "Lopez Island Farm",
	"description": "Lopez Island Farm is located in the San Juan Islands of the Pacific               Northwest and is blessed with a climate that is perfect for raising               grass-fed livestock. Even in the middle of winter, some days are               warm enough for the grass to grow. My sheep are on pasture all year               and lambing is timed to take advantage of the spring flush of grass.               My lamb is produced without antibiotics or hormones and finished               on grass in the spring and fall. The breeds I use were developed               to finish on grass and are lean with a delicate flavor.              My pasture raised pigs live outside where they               can forage and root to their hearts' content. In addition to the               health and nutritional benefits from pasture grazing, they just               plain enjoy digging. Happy pigs are healthy pigs and mine do not               need antibiotics or hormones.              Lamb and pork are available in               our retail store at the farm on Lopez Island, Lopez Farmers Market,               Proctor Farmers Market in Tacoma and by special arrangement.               We deliver regularly to customers in Seattle, Bainbridge Island               and Tacoma.               Lopez Island Farm, 193               Cross Road, Lopez Island WA 98261 (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=193%20Cross%20Road%2C%20Lopez%20Island%20WA%2098261).                (360) 468-4620. E-mail: bruce@lopezislandfarm.com (mailto:bruce@lopezislandfarm.com)",
	"products": [
		"Lamb",
		"Pork"
	],
	"location": {
		"city": "Lopez Island",
		"state": "Washington",
		"coordinates": [
			122.900465,
			48.535895,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86750"
	},
	"name": "Lostine Cattle Company",
	"description": "Lostine  Cattle Company employs  the same sustainable, estate wine-growing philosophies as Leonetti Cellar and FIGGINS,  the other Figgins Family Wine Estate brands, and applies them to the growing  and harvesting of Scottish Highland Beef Cattle.               Raised in  the pristine Wallowa Valley in Eastern Oregon, the cows are allowed to graze  freely for their entire life on a superb grass mixture in an Oregon Tilth  certified organic, biologically-farmed pasture. The cattle are never fed  hormones or antibiotics, and as a final treat, they sometimes enjoy Pommace  (pressed out grape skins) from our estate wineries.               We  humanely harvest at a natural maturity age of 28-36 months, which intensifies  flavor and quality of the beef. The beef is then dry aged for up to 28 days  prior to being processed by our artisanal butcher. The meat is then cryovac  packaged and immediately frozen.                Lostine  Cattle Company strives to produce the most sustainable, finest quality beef  available anywhere. We offer a combination of premium cuts such as steaks,  along with roasts and other popular \u0026 classic cuts as a part of our  quarter, half and whole beef program.               For more information about purchasing Lostine Cattle Company beef, please visit  our website. To purchase a quarter, half or whole  beef please call us directly at 1-877-581-9618. We offer delivery to Seattle,  Portland, Tri Cities, and Spokane as well as split shipping options if freezer  space is a concern.                Lostine Cattle Company, Carlye Knowles, PO Box 604, Walla Walla WA (http://maps.google.com/maps?q=Walla+Walla+WA\u0026hl=en\u0026ll=46.057985,-118.344727\u0026spn=9.728736,23.269043\u0026sll=37.0625,-95.677068\u0026sspn=44.204685,93.076172\u0026vpsrc=6\u0026hnear=Walla+Walla,+Washington\u0026t=m\u0026z=6) 99362. (877) 581-9618.                E-mail: info@lostinecattlecompany.com ",
	"website": " http://www.lostinecattlecompany.com (http://www.lostinecattlecompany.com/).",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Walla Walla",
		"state": "Washington",
		"coordinates": [
			118.34302100000001,
			46.064581000000004,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86751"
	},
	"name": "Lowell Road Farms",
	"description": "Lowell Road Farms in Snohomish, Washington                is proud to offer Grass Fed Angus Beef, born and raised                on our farm in the beautiful Snohomish Valley and free of hormones,                GMOs, animal by products, synthetic chemicals, etc. We pride                ourselves on providing humane and loving care to each animal.                A clean and stress-free environment ensures that our cattle lead            a content life and develop into an outstanding beef product.                          We charge by the pound, hanging weight. There              is an additional fee to cut and wrap as well as a fee for the humane              farm harvest by a local meat cutter. The beef is then aged and              cut and wrapped locally as per your specifications.                          Beef is available by the whole or half with              a $100 deposit due prior to harvest. Beef is also available for              live delivery “ on the hoof. Delivery charges are based on distance.            Call for pricing.                          We are happy to answer any questions you may              have. We harvest in the fall and sold out last year. Call soon            to reserve yours!                         Lowell Road Farms, Randy Forman, 805                80th Street SW, Everett WA 98203 (http://maps.google.com/maps?q=805+80th+Street+SW,+Everett+WA+98203\u0026hl=en\u0026ll=47.925545,-122.244873\u0026spn=1.560732,3.532104\u0026sll=37.0625,-95.677068\u0026sspn=58.164117,113.027344\u0026vpsrc=6\u0026hnear=805+80th+St+SW,+Everett,+Washington+98203\u0026t=m\u0026z=9). (425) 308-1309. E-mail: rforman@pacifictopsoils.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Everett",
		"state": "Washington",
		"coordinates": [
			122.24523399999998,
			47.926311,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86752"
	},
	"name": "Maple K Farms",
	"description": "Maple K Farms was established in 1936 in the lush rolling hills of the Palouse. We provide natural grass fed/grass finished beef from Highland cattle. Their meat is known for its lean, healthy attributes as well as the rich robust flavor.  We are committed to sustainable farming practices which include environmental responsibility, animal welfare, and maintaining locally grown foods for our community. Our cattle are raised on lush pastures with abundant cool clear water, the way nature intended. The cattle receive a tag at birth and records are kept on their health and well being from birth to harvest. It has been said that they only have \"one bad moment\" in their lives. Our Highland beef is available in the fall of the year by the 1/4, 1/2 or a whole beef. It is dry aged for 7“10 days, then cut, wrapped and frozen to your specifications by a state-certified meat cutting establishment. We invite our potential customers to come tour our farm to prove that we walk the talk. Our naturallished Highland beef is strictly available from the farm. Call or email to order. Maple K Farms LLC, Tom and Cheryl Kammerzell, 1102 Kammerzell Road, Colfax WA 99111. (509) 397-4589.  E-mail: maplekfarms@gmail.com",
	"website": " http://www.maplekhighlands.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Colfax",
		"state": "Washington",
		"coordinates": [
			117.473264,
			46.816719,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86753"
	},
	"name": "McFarland Creek Lamb Ranch",
	"description": "McFarland Creek Lamb Ranch is a small farm located in the Methow Valley in North Central Washington State. The year-round creek is used to provide abundant water for pasture, fruit trees and a small garden. We maintain a small flock of Romney and Romney/Cormo cross sheep that feed on lush pasture in the summer months, and local hay in the winter. The wool is used to make naturally dyed yarn, and we select the best lambs for direct market meat sales.  Our philosophy is to practice sustainability and use our resources in the most efficient and responsible way possible. Our lambs nurse on their mothers until they are naturally weaned, and are harvested on site by us, so the stress is minimal. We maintain secure fencing and have guardian dogs to protect the flock from predators so that we can live in harmony with our surroundings.  McFarland Creek Lamb Ranch, Katie Haven, PO Box 510, Methow, WA 98834. (509) 923-1916. E-mail: Katie@thelambranch.com",
	"website": " www.thelambranch.com ",
	"products": "Lamb",
	"location": {
		"city": "Methow",
		"state": "Washington",
		"coordinates": [
			120.00372590000002,
			48.1301694,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86754"
	},
	"name": "Misty Meadows Farm",
	"description": "Misty Meadows Farm offers certified                organic eggs, u-cut Christmas trees, angora wool, Romney wool, lamb,            chicken, turkeys and pork locally and in season.              Currently, our certified organic eggs                are available by subscription or individually from the farm in                Everson, WA.  We had our              eggs tested at a nutritional testing lab as part of a study on              pasture raised eggs.  Our eggs have 1/2 the cholesterol, 5              times the vitamin E, nearly 20 times the folate, and over 12 times              the Omega 3 of factory farmed eggs.  Check out our web site              for the complete details of this study and other research projects.             Our children are raising wool animals                for 4-H projects.  Our              daughter has a flock of Romney sheep and has wool available on              the farm website.  Our son is raising French Angora and German              (Giant) Angora rabbits for wool production.  He is the first              to receive organic certification from the WSDA for angora wool.  Our              website has a current list of wool products available.  All              proceeds from wool sales go directly to the 4-H child responsible              for raising the animals.             In the spring, we take orders for pasture-raised                lamb, chicken, turkey and pork.  Our web site will have              ordering information when these items are available.             In December, we open our farm for u-cut                organic Christmas trees.  We              were the first farm in Washington State to receive organic certification              for Christmas trees.             For more information about any aspect                of our farm or current availability of farm products, please              see our website.             Misty Meadows Farm, Mark and Melissa Moeller, 6197                Everson Goshen Road, Everson WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=6197+Everson+Goshen+Road,+Everson+WA\u0026sll=47.269169,-122.47624\u0026sspn=0.010178,0.017595\u0026ie=UTF8\u0026ll=48.864715,-122.376709\u0026spn=5.05198,9.008789\u0026z=7\u0026iwloc=addr\u0026om=1) 98247. (360) 312-3554.                E-mail: info@mistymeadowsfarm.com (mailto:info@mistymeadowsfarm.com).                            ",
	"website": " http://www.mistymeadowsfarm.com",
	"products": [
		"Eggs",
		"Lamb",
		"Chicken",
		"Turkey",
		"Pork",
		"Wool",
		"Christmas trees"
	],
	"location": {
		"city": "Everson",
		"state": "Washington",
		"coordinates": [
			122.37569,
			48.865621000000004,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86755"
	},
	"name": "MMS Organic Acres",
	"description": "Our farm,               MMS Organic Acres, in Selah, Washington consists of 42 acres               of orchard, vegetables, pasture and some sagebrush and bunch grass.                          Our intention is to annually buy 8“10               beef type steers which are free of any additives. We can then enjoy               watching them grow and prosper on our lush and remineralized pasture.                         We believe we raise quality beef because,               in addition to our farm, for 30 years we have owned and operated               a business, Algro Farms, which promotes Eco-Ag and Organic principles.               Our products are foliar nutrients and soil amendments to remineralize               and reduce soil compaction. We follow the Albrecht teachings and               specialize in increasing the brix levels in all crops. In our property               we have organic matter levels up to 5% using our techniques without               using compost or manure.              You may select the animal you want (or we can)               and we will take care of the processing, which includes dry aging.               We sell the animals based on hanging weight, but arrangements can               be made for a live weight transaction.             We have some animals left to sell and look forward               to working with you.              MMS Organic Acres, Merle Smith, 2050               McGonagle Road, Selah WA 98942 (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=2050%20McGonagle%20Road%2C%20Selah%20WA%2098942). (509) 697-7621,  E-mail:               mmdj@elltel.net (mailto:mmdj@elltel.net)",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Selah",
		"state": "Washington",
		"coordinates": [
			120.56650199999999,
			46.676055,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86756"
	},
	"name": " Moir Country Farm",
	"description": "Moir Country Farm raises pastured poultry, meat goats,  pigs, hay and beef on our farm located just south  Chehalis, WA.         To date, we have raised mainly  Cornish cross chickens. We are also experimenting with        other breeds such as Red Ranger  and Turken (naked neck chickens). Our chickens are started indoors        and then moved outside to  pastures at about 3 weeks of age or when weather allows. They are fed        certified organic feed. Our  pastures are not certified organic, but the only fertilizer is from our beef  herd        and from neighboring dairies and  chickens.  The birds are at least 10 weeks of age at harvest. The  target        is to harvest at 5 lbs. but sizes  have ranged from 3# to 13#. We are WSDA inspected. Poultry is  sold        fresh from the farm at time of  harvest.  Frozen chickens are available as long as supply lasts. We  are         also developing markets to make  our products available at grocery stores and local meat markets. We        harvest approximately once per month from  July-October. Call to find out the next harvest and place your order.        In 2010, we purchased the  neighboring farm and are growing our beef herd, as well as raising meat goats,         grass hay and market hogs. Our  goats kid in March and have whethers available from mid summer         through fall. We have a  limited number of pigs that will be available for sale by the half this  fall. Call now         to place an order.         In  the future, we will have grass beef  for sale. Grass hay is for sale  year around.Moir Country Farm is easily  accessed from I-5 being just 2 miles east of exit 74. Delivery is  available to        the Olympia area.        Moir Country Farm, Donna Moir, 215 Macomber Road, Chehalis WA 98532 (https://www.google.com/maps?q=215+Macomber+Road,+Chehalis+WA+98532\u0026hl=en\u0026ll=46.632465,-122.895813\u0026spn=1.208915,2.798767\u0026sll=37.0625,-95.677068\u0026sspn=44.388698,89.560547\u0026hnear=215+Macomber+Rd,+Chehalis,+Washington+98532\u0026t=m\u0026z=9). (360) 748-4517.         E-mail: moir@moircountry.com",
	"website": " http://www.moircountry.com",
	"products": [
		"Chicken",
		"Goats",
		"Pork",
		"Beef"
	],
	"location": {
		"city": "Chehalis",
		"state": "Washington",
		"coordinates": [
			122.89774600000001,
			46.63315,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86757"
	},
	"name": "Mt. Capra Farm Store",
	"description": "Mt. Capra is a small, family-run farm in the Pacific Northwest which, for nearly a century, has been producing premium whole foods and nutritional products from goat milk. Our farm is located in Centralia, WA and our storefront can be found in the neighboring town of Chehalis, WA.  We offer pastured eggs, apple cider vinegar, clarified goat milk butter (ghee), goat milk powder and various powdered goat milk products such as protein, minerals, lactose, cream, and yogurt. Note: Our goats do receive about a handful each of non-gmo grain that we use to get them to come into the parlor; otherwise they are grain-free. Mt. Capra, Joe Stout, 20625 O'Connor Road SE, Centralia, WA 98531. Address to farmstore: 448 N. Market Blvd, Chehalis, WA 98532. (360) 748-4224. E-mail: joe@mtcapra.com",
	"website": " https://www.mtcapra.com",
	"products": "Goats",
	"location": {
		"city": "Chehalis",
		"state": "Washington",
		"coordinates": [
			122.96878459999999,
			46.66484370000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86758"
	},
	"name": "Mountain Beef - Pickup location",
	"description": "Ramsden Ranch                    provides Mountain Beef. Our cattle are grazed in balance                    with nature's law. They forage year-round and we feed no            hay. That is wild.       Our beef is sold in halves and wholes. See        website for details.         Our goals are to provide wholesome, healthful meat        and to promote a pastoral grazing system that will inherently advance        the management of our natural resources, thus becoming a sustainable        ranch and a home where our children can grow. Ultimately we strive to        benefit the land, community and our own family through thoughtful and        caring stewardship.        Our ranch is situated on the border between Washington and Oregon. In 2013 we will be selling our beef at the Edmonds, Washington        Farmers Market, Saturdays, 9am-3pm, from June 29 to October 5.         Ramsden Ranch Mountain Beef, Mark and Amy Ramsden,        68340 Warnock          Road, Lostine OR 97857. (http://www.google.com/maphp?hl=en\u0026tab=wl\u0026q=68340%20Warnock%20Road%2C%20Lostine%20OR%2097857) (541) 263-1515. E-mail: ramsdenranch@eoni.com        ",
	"website": " http://www.mountain-beef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Edmonds",
		"state": "Washington",
		"coordinates": [
			122.377355,
			47.810652,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86759"
	},
	"name": "Naff Family Farm",
	"description": "Naff Family Farm is a small, family-owned and -operated farm located in the shadow of Mount Rainier on the beautiful Enumclaw Plateau. We live on our farm, do the work of our farm, and eat from our farm. Our purpose in farming this land is to sustain our family and to share the life and abundance of our farm with our community.  Our farming philosophy is based upon the understanding that we are farmers of grass and stewards of our soil. Our goal is to work with our grazing animals to increase the health of our pastures. Robust soil, fresh air, and our Northwest rain produce lush pasture grasses. Grazed by our cattle, they provide nourishing and delicious food for you and your family.  Naff Family Farm sells grass-fed, pasture finished beef by the whole, half, and quarter. We also sell milk-fed pork and pastured rabbit.  Our animals are harvested and butchered by Olson's Meats in Enumclaw where you can pick up your cut and wrapped meat. Our farm is 10 minutes away from Olson's and we always welcome visitors.  Naff Family Farm, Ted Naff, 46601 276th Ave SE, Enumclaw, WA 98022. (360) 825-1822.  E-mail: tedandsarah@naff-farm.com",
	"website": " www.naff-farm.com",
	"products": [
		"Beef",
		"Rabbit",
		"Pork"
	],
	"location": {
		"city": "Enumclaw",
		"state": "Washington",
		"coordinates": [
			121.9743347,
			47.184346,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675a"
	},
	"name": "Nelson Ranch",
	"description": "The Nelson Ranch has  been providing quality meat to our community for 150 years. We raise  All-Natural grass fed cattle free of additives, chemicals, antibiotics, and  growth hormones. All of our cattle are born on the prairies of South Thurston  County in the spring and range free on our acreage. Since all our animals are  born on the farm, you are assured of the source and safety of your beef.                We believe in being  responsible stewards of the land and using sustainable, humane methods.  Therefore, we do \"rotational grazing\" which not only allows us to  maintain healthy pastures but also allows our cattle to graze on the most  nutrient rich part of the grass. Since we are on the banks of the Deschutes  River, the yearly flooding of our fields ensures an endless supply of natural  minerals and nutrient rich soil. We then feed the cattle the hay during the  winter months.                Our family-owned farm is  about ten miles south of Olympia and one of the oldest ranches in the county  still owned by the original family. We have dedicated ourselves to providing  our customers with the most wholesome, best tasting beef available. We are  committed to sustainable farming practices and providing our community with a  locally grown, quality product. This has been a tradition in the family for  five generations and we hope that you enjoy it too.                You can buy individual  cuts, a quarter, or a half of beef. Buyers who purchase a quarter will receive  approximately 150 pounds of beef”a mixture of steaks, hamburger, roasts, and  stew meat.                We are happy to give  farm tours for people interested in our methods and products. Please call or  e-mail first to be sure we are home. Please visit our website for current  prices and ordering information.                 Nelson Ranch, Jill  Nelson, 3624 Waldrick Road SE, Olympia WA 98501 (http://maps.google.com/maps?q=3624+Waldrick+Road+SE,+Olympia+WA+98501\u0026hl=en\u0026ll=46.924007,-122.843628\u0026spn=1.53253,3.56781\u0026sll=37.0625,-95.677068\u0026sspn=56.112526,114.169922\u0026vpsrc=6\u0026hnear=3624+Waldrick+Rd+SE,+Olympia,+Washington+98513\u0026t=m\u0026z=9). (360)  352-4124.         E-mail: jill@nelsonranch.com ",
	"website": " http://www.nelsonranch.com (http://www.nelsonranch.com/)",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Olympia",
		"state": "Washington",
		"coordinates": [
			122.842848,
			46.923898,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675b"
	},
	"name": "Nettles Farm",
	"description": "Nettles               Farm provides eggs from pastured poultry year round.               Pastured broilers are available from August to November.               In addition, the farm offers bounty from their garden and kitchen,               including fresh pasta, ravioli, lasagna, washed and bagged greens               (April“November), tomatoes and other vegetables (June-November.)                           Our farm is certified organic, but our raison               d'etre is to produce truly flavorful food, sustainably.              Nettles Farm, Riley Starks,  4300 Matia View               Drive, Lummi               Island WA (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=4300%20Matia%20View%20Drive%2C%20Lummi%20Island%20WA%2098262) 98262. (360) 758-7814. E-mail: nettles@nas.com (mailto:nettles@nas.com)                             ",
	"website": " http://www.nettlesfarm.com/pasta",
	"products": [
		"Eggs",
		"Chicken"
	],
	"location": {
		"city": "Lummi Island",
		"state": "Washington",
		"coordinates": [
			122.714722,
			48.73786,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675c"
	},
	"name": "Northwest Wild Foods",
	"description": "Wild Blue Huckleberries, Wild Red Huckleberries, Wild Blueberries, Little WIld Blackberries.  Northwest Wild Foods specializes in              providing customers with all natural, wild berries handpicked in              the mountains of the great Pacific Northwest. We have Frozen Wild            Blue Huckleberries,               Wild Red Huckleberries, Wild Blueberries and our famous Little            Wild Blackberries.                          All our special berries are harvested              in the wild, cleaned, individually quick frozen and packaged to              meet customer™s              needs using no additives. These             unique berries are great tasting, high in antioxidants and            healthy.                          We also have a line of Jams,                Syrups, Honeys            and gift packs made all naturally with our wild berries.                                        We have our retail site on the              internet at www.nwwildfoods.com (http://www.nwwildfoods.com/) and              we also sell wholesale, simply             contact us at (866) 945-3232.                          We ship via UPS ground, 2nd day              air or overnight. For larger orders we               ship with Sorensen Trucking FOB from Bellingham, WA.             Northwest Wild Foods, Thomas LaMonte, PO Box              855, Burlington              WA  (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=Burlington+WA+\u0026ie=UTF8\u0026ll=48.472921,-122.332764\u0026spn=4.661888,10.151367\u0026z=7\u0026iwloc=addr)98233. (866) 945-3232. E-mail: thebear@nwwildfoods.com (mailto:thebear@nwwildfoods.com). ",
	"website": "              http://www.nwwildfoods.com",
	"products": "Berries",
	"location": {
		"city": "Burlington",
		"state": "Washington",
		"coordinates": [
			122.33152999999999,
			48.47554,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675d"
	},
	"name": "On the Lamb Farm",
	"description": "On The  Lamb Farm is a  small, family-run farm in Arlington, Washington. We offer grass-fed lamb and beef. Our animals are custom cut  and wrapped to your specifications by a popular local licensed butcher. Our animals are strictly grass-fed and  pasture-raised to provide you with the healthiest meat possible.                   Lamb is  available in early fall, and we sell it as a whole animal. Lamb is in high demand and often sells out  several months in advance.                     Beef is  available from spring to early winter. We sell beef by the half-side (quarter),  side, or whole animal.                      We are  located close to Seattle, making pickup easy for our Seattle area customers.                     We are Sara-Jo  Gahm and John Connolly. Contact us at:                                        On  the Lamb Farm, 10915 Moran Road, Arlington WA 98223 (http://www.google.com/maphp?hl=en\u0026tab=wl\u0026q=10915%20Moran%20Road%2C%20Arlington%20WA%2098223). (360)  435-9078.                                    E-mail: contact@onthelambfarm.com ",
	"website": "http://www.onthelambfarm.com (http://www.onthelambfarm.com/).",
	"products": [
		"Beef",
		"Lamb"
	],
	"location": {
		"city": "Arlington",
		"state": "Washington",
		"coordinates": [
			122.086387,
			48.187158,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675e"
	},
	"name": "Oyster Bay Farm",
	"description": "Oyster               Bay Farm offers lamb from animals that were fed small               amounts of grain. It is available in the fall \"just as the               rains are making our pasture too wet for grazing.\"                Lamb is available as whole or half carcasses.               Most lambs dress out to a hanging weight of 50 pounds. You pick               up your packaged, frozen lamb at the butchers when they call and               tell you it's ready. Typical cost for a lamb with a hanging weight               of 50 pounds is about $250. This price includes custom slaughter,               cut, wrap, and freezing, to buyer's specifications. Larger lambs,               smaller lambs, and halves cost proportionally.               Oyster Bay Farm, Pat Lubine, 4931 Oyster Bay               Road NW, Olympia               WA (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=4931%20Oyster%20Bay%20Road%20NW%2C%20Olympia%20WA%2098502)  98502. (360) 866-9424.",
	"products": "Lamb",
	"location": {
		"city": "Olympia",
		"state": "Washington",
		"coordinates": [
			123.04348499999999,
			47.104268,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8675f"
	},
	"name": "Palouse Pastured Poultry",
	"description": "Palouse Pastured Poultry, located just 30 miles south of Spokane,        is a small family-owned farm in the heart of the Palouse country in eastern        Washington. It is an area renowned for its rolling hills and grain production.  We        specialize in raising all natural pastured poultry, including USDA        certified-organic, free-range broiler chickens and turkeys; grass-fed,        free range chicken pullets and eggs, and duck        eggs.        You can call us directly to place an order, or visit        us at the Spokane Farmers Market, Saturdays and Wednesdays, 8am“1pm,        or the Kootenai County Farmers Market, Saturdays, 8am“1pm; both        markets run May“October.        Palouse Pastured Poultry, Allen Widman, 4          West Babb Road, Rosalia WA 99170 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=4+West+Babb+Road,+Rosalia+WA+99170\u0026aq=\u0026sll=47.289844,-117.445757\u0026sspn=0.001885,0.004565\u0026ie=UTF8\u0026hq=\u0026hnear=4+W+Babb+Rd,+Rosalia,+Spokane,+Washington+99170\u0026ll=47.286516,-117.445234\u0026spn=7.722724,18.69873\u0026z=6).(509) 523-4833.          E-mail: allen@palousepasturedpoultry.com (mailto:allen@palousepasturedpoultry.com).",
	"website": " http://www.palousepasturedpoultry.com",
	"products": [
		"Chicken",
		"Turkey",
		"Eggs",
		"Duck Eggs"
	],
	"location": {
		"city": "Rosalia",
		"state": "Washington",
		"coordinates": [
			117.44523400000001,
			47.286516,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86760"
	},
	"name": "PnD Organic Beef",
	"description": "PnD Organic Beef brings you the highest quality 100% USDA                    Certified Organic Pasture-fed Angus Beef.                                                                Our farm is located in beautiful Lewis                    County, and has been in the family for 44 years, seven of                    those being certified by Washington State.  Every animal except our bull has been born                    and raised here, out with their mothers on our lush, green                    fields.                    Our animals are 100% pasture-fed.  Even when inclement                    weather forces us to house them, they are only fed premium                    silage and hay from our own fields.  We use no antibiotics,                    hormones, or any other non-approved feeds, resulting in tender,                    scrumptious meat that is not only good for you, but safe                    for your loved ones.                    Not all organic beef is pasture-fed,                      and not all pasture-fed beef is Certified Organic. We have                    the best of both worlds!!  Pasture-fed means our animals                    are fed no grains that are difficult for the animal to digest,                    and can lead to illness. Eating a diet that comes naturally                    puts less stress on the individual animal and it is stronger                    and healthier.  For more detailed information, please                    visit our site.                    Certified Organic means that we                      are inspected once a year, and keep extensive records on                      all of our animals and farming practices.  We use                      absolutely no pesticides, herbicides, or chemical fertilizers                      that damage the soil and everything around it. We                      also have an agreement with the county to not spray our                      ditches, eliminating any outside contamination. œNatural and                      non-certified pasture-fed farms are not required to follow                      these practices.                    Certified Organic Pasture-fed Angus                      Beef is indeed the best choice for the animal, your family,                      and the environment!   Please                    call or visit anytime.  We sell quarter, halves, and                    whole beef.              PnD Organic Beef dba Business Enterprises Unlimited,        Inc., Paul and Dalene Olson, 282        Kirkland Road, Chehalis WA  98532 (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=282+Kirkland+Road,+Chehalis+WA%C2%A0\u0026sll=37.0625,-95.677068\u0026sspn=35.547176,51.855469\u0026ie=UTF8\u0026ll=46.995241,-122.893066\u0026spn=3.828927,6.481934\u0026z=7).         (360) 748-7873.         E-mail: pdolson2@gmail.com       ",
	"website": " http://www.pndorganicbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Chehalis",
		"state": "Washington",
		"coordinates": [
			122.892665,
			46.603415,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86761"
	},
	"name": "Pond's Pierre Lake Valley Ranch",
	"description": "Pond's Pierre Lake Valley                Ranch is  owned and operated by Gene and              Sharon Pond and located in the timbered mountains of Northeast              Washington, 100 miles north of Spokane. Settled by Gene's father              shortly after his discharge from the military following World War              I, this operation is rich in heritage and will soon be a Century              Farm. The ranch consists of 400 acres of deeded land and approximately              5000 acres of leased mountain rangeland.             We are in complete disagreement with the              trend of emphasizing more production through chemicals and hybridization              techniques. Both our cowherd and the grazing lands remain free              from the influence of modern agriculture as an all-natural, grassfed              business.               Though Gene and his father tried using fertilizers              on a limited scale after they first became available, the land              that was fertilized has been chemical-free for decades. The hay              that we feed during the winter snow season is also grown without              chemicals.               The cowherd retains its uniqueness by keeping              its roots in genetics as purebred Herefords sourced from the 1960s              and early 1970s. Emphasis has long been placed on having animals              that will benefit and improve the land. The combination of environment              and genetics blend to create a healthy and flavorful product.              Farm-slaughtered, preordered beef product is              available in the late summer through fall, with one half of a beef              required as a minimum purchase. Select USDA inspected cuts and              specialty items, such as jerky and sausages, are available throughout              the year. Call for current prices and specials. All orders are              filled FOB at Chewelah, WA and complete satisfaction is guaranteed.              Pond's Pierre Lake Valley Ranch, Gene and Sharon              Pond, 2791 Pierre Lake Road, Kettle              Falls WA 99141 (http://g.co/maps/eqg38). (509) 738-6182.",
	"products": [
		"Beef",
		"Jerky",
		"Sausage"
	],
	"location": {
		"city": "Kettle Falls",
		"state": "Washington",
		"coordinates": [
			118.140855,
			48.842301,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86762"
	},
	"name": "Prairie Springs Ranch",
	"description": "Prairie                Springs Ranch”old fashioned, 100% grass raised beef made                affordable to families. Animals are born and raised here and                are entirely grass fed and finished.               No pesticides, hormones or antibiotics. Your              meat is dry-aged, custom cut and wrapped by folks who have been              in the business for 50 years. The animals are Chiangus, an Italian              cross with registered Angus. We charge $3.49 per pound hanging            weight. This price INCLUDES butcher, cutting and wrapping.              Every              fall the healthy grass-fed animals are processed by the whole,              half, or quarter to bring to your table. Our lowland pasture has              a longer than usual growing season, so we usually butcher mid to              late November. We hope to hear from you! Don™t delay: we            usually sell out early.                         Prairie Springs Ranch, John and Jean Shea,              PO Box 311, Bow               WA (http://www.mapquest.com/maps/map.adp?country=US\u0026address=\u0026city=Bow\u0026state=WA)  98232. (360) 421-0535.               E-mail is best: reality@fidalgo.net (mailto:reality@fidalgo.net)                             ",
	"website": "http://www.prairiespringsranch.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Bow",
		"state": "Washington",
		"coordinates": [
			122.39807999999998,
			48.56034,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86763"
	},
	"name": "Pride \u0026 Joy Dairy",
	"description": "Pride \u0026 Joy Dairy is located in the agriculturally rich Yakima              Valley.               Our signature item is our delicious and rich œcream on the              top  WSDA certified organic and grass fed raw cow™s              milk products. Because our cows are fed 100% grass eight              months of the year, the resulting dairy products are packed with              omega 3™s and cancer-preventing CLA™s (conjugated            linoleic acid (http://www.eatwild.com/cla.html)).               Our Grade A grass                  fed raw cow™s milk is              available year-around and our cow™s are pampered with a no              stress lifestyle. They feast on luscious fresh green grass and              our pastures are farmed with management intensive grazing (MIG)              practices. This intensive              pasture rotation plan is used in lieu of chemical fertilizers or              pesticides. During the winter months when fresh grass is              not available, we purchase high mountain certified organic hay              from Simon Farms in Fairfield, ID. Our free-ranging chickens              forage, fertilize and cleanse the pastures behind our dairy herd. The              resulting dairy, meat, and eggs are of impeccable quality both            in flavor and health properties.               We have been farming with organic and chemical-free              practices for over 15 years and have been certified organic with              the WSDA for the past 5 years.  None of our animals are               fed antibiotics or hormones and our pastures are not treated with            pesticides, synthetic fertilizers, or any chemical substances.               We also offer 100% grass feed beef and                lamb. Our beef is              available in whole and halves and is dry-aged and custom cut according              to your specifications”generally available late fall. As              part of our MIG practices, we also have fresh eggs available on            a limited basis.               We encourage visitors to come to the farm!  We™d              love to take you on a tour and show off our working Border Collie            dogs.               Please visit our website, email, or call for              more information. And              check this listing frequently as our product line is growing!              Pride \u0026 Joy Dairy, Allen and Cheryl Voortman,              2145              Liberty Road, Granger WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=2145+Liberty+Road,+Granger+WA\u0026sll=37.0625,-95.677068\u0026sspn=39.916234,57.568359\u0026ie=UTF8\u0026ll=46.664517,-120.146484\u0026spn=8.670294,14.39209\u0026z=6\u0026iwloc=addr)  98932. (509) 854-1389.                E-mail:              prideandJoydf@earthlink.net (mailto:prideandJoydf@earthlink.net).               ",
	"website": " http://www.prideandjoydairy.com",
	"products": [
		"Dairy",
		"Eggs",
		"Lamb",
		"Beef"
	],
	"location": {
		"city": "Granger",
		"state": "Washington",
		"coordinates": [
			120.14630699999998,
			46.367477,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86764"
	},
	"name": "Promised Land Ranch",
	"description": "Promised Land Ranch is a family farm located in the mountains of the               Okanogan Highlands. We offer grassfed beef, pastured chickens               and turkeys, eggs from pastured hens, rabbits               and vegetables. We practice sustainable farming methods and               raise our animals in as natural conditions as possible with lots               of green grass as the cornerstone. The meat is free of artificial               hormones and antibiotics.               Grassfed beef is available in whole, halves,               or split halves. Pastured poultry is available as whole fryers and               stewing hens. Rabbits, turkeys and fresh produce are available as               well.             We believe that an honest, open relationship               between farmer and consumer is mutually beneficial and encourage               you to visit. Call for more information and a newsletter.              Promised Land Ranch, Joel or Sara Kretz, 1014               Toroda Creek Road, Wauconda               WA (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=1014%20Toroda%20Creek%20Road%2C%20Wauconda%20WA%2098859)  98859. Phone: (509) 779-4105.",
	"products": [
		"Beef",
		"Chicken",
		"Turkey",
		"Eggs",
		"Rabbits"
	],
	"location": {
		"city": "Wauconda",
		"state": "Washington",
		"coordinates": [
			118.902643,
			48.810407,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86765"
	},
	"name": "Pure Ãire Dairy",
	"description": "Pure Ãire Dairy is located in Othello,        Washington in the heart of the Columbia Basin. We are proud to be one        of the few œgrass-only dairies        in the United States.  Our jersey cows are completely grass-fed        to provide you with milk that™s tasty and nutritious, just        as nature intended.         We are:                - 100% Grass-Fed (a rarity as there are very            few purely grass-fed dairies in the United States)           - Our herd has been hand-selected to be free of A1 positive cows          - Antibiotic and Hormone Free          - Free of chemicals, fertilizers and pesticides          - Transparent - giving you the ability            to know where              your milk comes from          - Our milk is not combined with milk from any other dairy          - All-jersey herd for better grazing and a rich,          creamy milk          - Minimally processed milk utilizing vat pasteurization and no homogenization              We currently have the following products available:        Pasteurized Whole, 2%, and Skim Milk, Heavy        Cream and Raw Milk at select        locations.        We have long believed you should always know          where your milk comes from. You        should be able to see for yourself what the animals eat and how they        are treated.  Our goal is to be a transparent operation to our consumers,        so that you can trust your milk source. We welcome you to come        and visit!  Go beyond organic, go grass-fed!        Pure Ã‰ire Dairy, Richard and Jill Smith,        1591        Birdwell Road, Othello WA 99344 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=1591+Birdwell+Road,+Othello+WA+99344\u0026sll=37.602788,-98.624782\u0026sspn=48.09582,79.013672\u0026ie=UTF8\u0026hq=\u0026hnear=1591+W+Birdwell+Rd,+Othello,+Adams,+Washington+99344\u0026ll=46.788307,-119.059911\u0026spn=10.533736,19.753418\u0026z=6). (509) 301-9512.          E-mail: pureeiredairy@aol.com (mailto:pureeiredairy@aol.com).       ",
	"website": " http://www.pureeiredairy.com",
	"products": "Dairy",
	"location": {
		"city": "Othello",
		"state": "Washington",
		"coordinates": [
			119.05990099999998,
			46.78848200000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86766"
	},
	"name": "Ramsden Ranch Mountain Beef",
	"description": "Bainbridge Island, WA. More information",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Bainbridge Island",
		"state": "Washington",
		"coordinates": [
			122.51361000000001,
			47.6248,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86767"
	},
	"name": "Ramstead Ranch",
	"description": "Ramstead Ranch is a diversified farm located 80 miles north of Spokane. We are committed to sustainable agriculture using grazing methods that help our land and our animals thrive.  Find our price list and place your orders online. You can pick up our meats at local farmers™ markets and specialty groceries in Spokane, WA and San Come by the f [arm to buy directly from your farmer, or join our mailing list to hear about our growing number of drop sites to pick up our meats in your local area.  You can buy the following meats in custom portions (whole/halves/quarters) or as individual market cuts: Beef”100% Grassfed and grass-finished on our lush pastures; steaks, roasts, ribs and more. Lamb”100% Grassfed and grass finished Romney lamb for a sweet, mild flavor Pork”Pasture-raised Berkshire pork; chops, sausages, bacon, hams, and more Chicken”Pasture-raised chickens are moved to new pastures daily; whole birds, breasts, legs, thighs and more  Turkey”Pasture-raised turkeys that forage on actively growing pastures; whole birds available seasonally; ground turkey, legs, thighs and wings. Organ meats, lard/suet, and bones are also available by the package. Raw Wool Fleeces. Don't forget the fiber! Our Romney and Romney-cross sheep not only produce tender lamb, but they also grow incredible fleeces. Two out of three farmers here at Ramstead are also handspinners who take care to raise beautifully clean fleeces that are a dream to handle.  Ramstead Ranch, Eileen Napier, PO Box 470, 990 Dennis Road, Ione, WA 99139. (509) 442-4725. E-mail: eileen@ramsteadranch.com",
	"website": " www.ramsteadranch.com; Facebook: www.facebook.com/RamsteadRanch",
	"products": [
		"Beef",
		"Lamb",
		"Pork",
		"Chicken",
		"Turkey"
	],
	"location": {
		"city": "Ione",
		"state": "Washington",
		"coordinates": [
			117.4318988,
			48.6996715,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86768"
	},
	"name": "Redfeather Farm",
	"description": "Redfeather Farm is our Animal Welfare Approved farmstead in Duvall, WA where we raise œgood food you can feel goodabout. We breed and raise heritage Berkshire hogs (pork) that live in roomy forested paddocks where they are free to root, run, nap, and play every single day. Our hogs enjoy a non-GMO, corn-free, soy-free diet along with vegetables from local organic farms.  We sell our market hogs by the whole and half and work exclusively with Kelso™s Kustom Meats in Snohomish, WA. Their on-farm slaughter team is also Animal Welfare Approved and harvests all our hogs right here on the farm.  Visit our website for photos of our happy hogs and our FAQ page for info on pricing. Thank you for choosing Redfeather, we look forward to feeding you well! Redfeather Farm LLC, Janya \u0026 Nate Veranth, PO Box 5, Duvall, WA 98019. (425) 531-1775 E-mail: redfeathercheviots@gmail.com",
	"website": " www.redfeatherfarm.org",
	"products": "Pork",
	"location": {
		"city": "Duvall",
		"state": "Washington",
		"coordinates": [
			121.98567809999997,
			47.7423218,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86769"
	},
	"name": "Rocky Ridge Ranch",
	"description": ", WA. Beef, pork, turkeys, chickens, eggs, produce.  Rocky                Ridge Ranch raises free-range pastured beef,                pork and poultry.               We practice all natural methods, which means              no medications, hormones, or animal by-products are ever used in              the feed. We mix and grind all our pork and poultry              feed using all natural products.               Our beef comes from Angus-X cows that              calf on open range and never experience confinement. They stay              in a natural family group herd as they are rotated through seven              40-acre pastures. They are grazed on a forage mix of annual crops              for a high quality natural forage finish in the late summer. Beef              are sold by quarter, half or whole and custom processed locally.               Pork are heritage breeds such as the              Berkshire, famous for its high quality meat and adaptation to pasture.              It is sold in halves or wholes, and custom processed locally.               Poultry: We have broilers and turkeys              and layers for high quality eggs.               Please review our website and place orders              early to insure availability. We welcome your call or visit at              the farm where we also grow organic produce.               Rocky Ridge Ranch, Gary M. Angell, PO Box 175,               Reardan               WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=reardan,+wa\u0026ie=UTF8\u0026ll=47.665387,-117.861328\u0026spn=18.862687,34.277344\u0026z=5\u0026iwloc=addr\u0026om=1)  99029. (509) 953-0905 / 796-3988.                E-mail: info@rockyridgeranchspokane.com (mailto:info@rockyridgeranchspokane.com)             ",
	"website": " http://www.rockyridgeranchspokane.com",
	"products": [
		"Beef",
		"Pork",
		"Turkey",
		"Chicken",
		"Eggs",
		"Produce"
	],
	"location": {
		"city": "Reardan",
		"state": "Washington",
		"coordinates": [
			117.87716000000002,
			47.66951,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676a"
	},
	"name": "Sage View Farm",
	"description": "Sage View Farm is located in Ellensburg, Washington. We provide  custom raised, 100%           grain-free,  grass fed beef raised in an all natural environment. We are a reputable farm  where we stand behind our product 100%.        Our excellent Angus cross bred beef are  grown on lush green  pastures that  are maintained through sustainable pasture  management. We care about how we raise our beef and it shows in our returning  satisfied customers.  At Sage View Farm, we offer beef that is:       ž¡ Custom raised, grass fed, grain-free   ž¡ Hormone-, additive-, and antibiotic-free   ž¡ Competitively priced   ž¡ A consistently exceptional product            ž¡ Processed by a reputable certified custom butcher   ž¡ Delivered in Washington               Visit us on our website and on Facebook. Feel free to call or email for more information.        Sage View Farm, Tim and Jana McIntyre, 11461 Thrall Road, Ellensburg WA 98926 (http://maps.google.com/maps?q=11461+Thrall+Road,+Ellensburg+WA+98926\u0026hl=en\u0026ll=46.927759,-120.360718\u0026spn=3.064832,7.13562\u0026sll=37.0625,-95.677068\u0026sspn=56.112526,114.169922\u0026vpsrc=6\u0026hnear=11461+Thrall+Rd,+Ellensburg,+Washington+98926\u0026t=m\u0026z=8). (509) 607-3805. E-mail:  sageviewfarm@yahoo.com",
	"website": " http://www.sageviewfarm.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Ellensburg",
		"state": "Washington",
		"coordinates": [
			120.364982,
			46.927476,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676b"
	},
	"name": "St John Creamery",
	"description": "St John Creamery is a raw grassfed goat dairy in Lake Stevens, WA.  We have a delightful herd of rare Oberhasli dairy goats who eat off our organically managed pastures, non-gmo alfalfa and local farmers unsprayed grass hay. During the grazing season, we take the herd and go foraging on the 30 acres of wild space around the farm. There, the girls (goats) get to frolic and eat brambles, trees, weeds etc. I have counted over 50 different plants they can eat out there!  Raw goat milk is considered \"medicine\" in most of the world because it alkalinizes your body and strengthens it to fight off infections. It is so easily digested, it is the universal baby formula”all mammals can drink it. Goats milk is well known to be wonderful for any gut problems as well. We also offer seasonal raw aged goat cheese “ cheddar, gouda, jack, feta....aways open to suggested varieties! We sell off the farm or in private drops around Seattle and in many stores. Come see the website for where to find us. St John Creamery, Marcia St John, Mailing address: PO Box 2217, Snohomish WA 98291; farm address: 8431 30th St SE, Lake Stevens, WA 98258. (206) 909-5055. E-mail: stjohncreamery@gmail.com",
	"website": " stjohncreamery.com",
	"products": "Dairy",
	"location": {
		"city": "Lake Stevens",
		"state": "Washington",
		"coordinates": [
			122.0834782,
			47.9684098,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676c"
	},
	"name": "Sea Breeze Farm",
	"description": "Sea Breeze Farm is a diverse, multi-species, œbeyond                    organic, grass-based animal farm, located on the beautiful                    Isle of Vashon in Washington™s picturesque Puget Sound.                                        We do not apply commercial fertilizers of any kind to our                  pastures, relying instead on a grazing technique modeled                  after the migratory habits of wild cattle and bird populations.                  This labor-intensive, rotational system allows our freely-ranging                  poultry flocks to symbiotically forage, fertilize and cleanse                  the pastures behind our dairy herd. The resulting meat, dairy                  and eggs produced on our farm are of infinitely superior                  quality, both flavor- and health-wise than those produced                  conventionally, and in our opinion are significantly superior                  to typical œOrganic animal products. We also                    take pride in the sustainability and resource-wise management                    of our farm systems.                                        We sell our products only through local channels. Our meat,                    dairy, eggs, cheese, wines and prepared foods such                    as pates, sausages and meat broths are                    available from our retail butcher shop and restaurant in                    downtown Vashon Island, as well as the University District                    and Ballard Farmer™s Markets in Seattle. Our pure,                    whole, unadulterated cow™s milk is                    also available at the Madison Market (now Central Co-op)                    at 17th \u0026 Madison in Seattle. For directions to our retail                    shop, or to make reservations to our restaurant, click here: http://seabreezefarm.net/la_boucherie.html                    Please Note:  We never freeze                    our meats, we do not ship, we do not deliver, we do not do                    CSAs, we do not organize any \"Buying Clubs,\" and                    we do not sell \"locker meats\" (whole or half carcass                    packages).   Our  focus is on fresh, local, retail sales. Thank you for understanding.                    Farmers Markets: University District Farmer™s Market”Saturdays  9am“2 pm, Year-Round. Meat, dairy, eggs, wine, prepared foods.   Ballard Farmer™s Market”Sundays 10am“3 pm, Year-Round.  Meat, dairy, eggs, wine, prepared foods.                    Grocery Stores: Madison Market (Central Co-op),                    17th \u0026 Madison,  Seattle, WA. Whole, raw, grass-fed cow™s milk.                    Restaurants: La Boucherie, Vashon Island (Our own restaurant).                    Sea Breeze Farm, Please contact                    us at our retail location, La Boucherie: (206) 567-4628 (GOAT).                     Contact E-mails here: http://seabreezefarm.net/contact_us.html.                   ",
	"website": " http://www.seabreezefarm.net",
	"products": [
		"Beef",
		"Chicken",
		"Dairy",
		"Eggs",
		"Cheese",
		"Pates",
		"Sausages",
		"Broth"
	],
	"location": {
		"city": "Vashon Island",
		"state": "Washington",
		"coordinates": [
			122.47893,
			47.420775,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676d"
	},
	"name": "Short's Family Farm",
	"description": "Short's Family Farm lies in the rain shadow of the beautiful  Olympic Mountains. Our natural 100% grassfed and finished beef is grown on the  lush pastures of Chimacum Valley.            By frequently rotating pastures our cattle learn to  appreciate our presence. We reward the cattle with fresh, untrampled lush grass  and clover and they reward us by being easy to handle. Even with over 100  mature cows and over 100 offspring, we know the unique individuality of the  herd and they certainly know us. The established bond makes for a low stress  environment. We manage special pastures for finishing 60“90 days before harvest  to boost nutritional value, flavor, marbling and tenderness.          We do not feed any grain, antibiotics, growth hormones or  steroids. If an occasional animal needs an antibiotic, it is identified and not  marketed through our normal program. Wormers and pesticides for flies and lice  are seldom used.          You can buy a whole, half or quarter. You can also buy  individual cuts that are double paper wrapped and frozen. All harvesting,  aging, cutting and wrapping is done under the watchful eyes of USDA inspectors.         We do not like the 180-mile drive to the harvesting  facility, but it is extremely clean, well organized, good people, and they age  and cut our animals exactly as ordered.          Because our soils are mostly peat in a frequently flooded  valley, we must keep our cattle in a large confinement area in the winter to  protect water quality and salmon habitat and to reduce field pugging. Our grass  and clover hay and silage are fed at these times.          Our farm store is open Saturdays, 10-3pm. We are looking for people  to serve as drop off     Beyond th [e Farm: We sell at the Chimacum Grange Farmers Market and Port  Ludlow Farmers Market May thru October. Port Townsend Food Coop has our beef  year-round.               Please check us out and enjoy local, tender, flavorful,  nutritious natural 100% grassfed beef.          Short's Family Farm, Roger Short, 1720 Center Road, Chimacum  WA (https://www.google.com/maps?q=1720+Center+Road,+Chimacum+WA\u0026hl=en\u0026ll=47.986245,-122.766724\u0026spn=1.937533,3.652954\u0026sll=37.0625,-95.677068\u0026sspn=36.642161,58.447266\u0026hnear=1720+Center+Rd,+Chimacum,+Washington+98325\u0026t=m\u0026z=8) 98325. (360) 732-4601 or (360) 301-3521.         E-mail: rshort42@gmail.com",
	"website": " http://www.shortsfamilyfarm.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Chimacum",
		"state": "Washington",
		"coordinates": [
			122.77080600000001,
			47.98639500000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676e"
	},
	"name": "Skagit River Ranch",
	"description": "Skagit  River Ranch is a  family-owned organic farm located in Sedro-Woolley. We specialize in 100%  grass-fed, Certified Organic Angus and Wagyu (Kobe) beef.        Certified  Organic since 1998, we farm bio-dynamically to build the soil and nutrient rich  grass that grow healthy animals. No antibiotics. No hormones. No chemicals. We  practice sustainable agriculture by using a pasture rotation system where our  animals graze on new green pasture on a daily basis to receive maximum  nutrition without overburdening the soil. We are dedicated to providing our  customers with the most wholesome, best tasting, ethically raised Certified Organic beef, pork, chicken and eggs available.                 Our Certified  Organic Meats \u0026 Eggs can be purchased at our Farm Store, selected  stores \u0026 farmer™s markets listed below:               - Farm  Store on our ranch “ We sell individual cuts of meat, eggs, as well as beef in  quarters, halves, or wholes (place order online, pick up at store). Open  Saturdays from 10 am “ 6 pm all year.         - Stores: Marlene™s Market \u0026 Deli (Federal Way \u0026 Tacoma), Central Co-op/Madison  Market (Seattle), PCC Natural Market (Edmonds \u0026 Redmond), Manna Mills (Mountlake  Terrace), Nature™s Market (Kent), Rockridge Orchards (Enumclaw), Skagit Valley  Food Co-op (Mount Vernon), Public Market/Terra Organica (Bellingham)         - Farmer™s  Markets: University, Ballard, West Seattle, Bellevue, Edmonds              Please see  details on our website.         We can now  ship our Certified Organic Wagyu (Kobe) Beef and Certified Organic Pork  products via Federal Express to anywhere in the U.S. Although we encourage people to  purchase locally as much as possible, if you cannot find a good local source on  the eatwild.com guide, we will gladly ship our products to you. Just go to our  website and place your order online, it will ship to you FedEx 2Day (shipping  is included in the price of the items).        Skagit River  Ranch, LLC., George and Eiko Vojkovich, 28778 Utopia Road, Sedro-Woolley,  WA 98284. (360) 856-0722. Fax: (360) 856-1372.         E-mail: eiko@cnw.com",
	"website": " http://www.skagitriverranch.com",
	"products": [
		"Beef",
		"Eggs",
		"Chicken",
		"Pork"
	],
	"location": {
		"city": "Sedro-Woolley",
		"state": "Washington",
		"coordinates": [
			122.122489,
			48.514835,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8676f"
	},
	"name": "Skiyou Ranch",
	"description": "Skiyou Ranch is a fourth generation small family        farm located in Sedro Woolley, about an hour and a half north of Seattle.        We specialize in 100% grassfed Certified Organic Angus beef.         We are a closed herd, therefore no exposure, having        no risk of disease. No antibiotics or chemicals are used. We are a sustainable        farm promoting humanely and ethically raised animals.         Please visit our website for ordering details.         Skiyou Ranch, Tarie and Lonn Benson, 26910          Duffy Road, Sedro Wooley WA 98284 (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026q=26910+Duffy+Rd,+Sedro-Woolley,+Skagit,+Washington+98284\u0026sll=42.313878,-122.89856\u0026sspn=2.583407,4.438477\u0026ie=UTF8\u0026cd=1\u0026geocode=FegR5AIdsuq3-A\u0026split=0\u0026hq=\u0026hnear=26910+Duffy+Rd,+Sedro-Woolley,+Skagit,+Washington+98284\u0026ll=48.501052,-122.164557\u0026spn=2.314914,4.438477\u0026z=8). (360) 708-3292.         E-mail: skiyouranch@gmail.com (mailto:skiyouranch@gmail.com).",
	"website": " http://www.skiyouranch.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Sedro-Woolley",
		"state": "Washington",
		"coordinates": [
			122.16455799999999,
			48.501224,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86770"
	},
	"name": "Steelhammer Family Farms",
	"description": "Steelhammer Family Farms is owned and operated by Mark \u0026 Luanne Steelhammer. Mark grew up on a dairy farm, and is now raising Angus grass fed beef. Our Angus start as baby calves and are raised to 2-3 years old before harvesting. Our Angus graze on lush grass in the summer and haylage in the winter. We produce our own haylage in the summer to assure it is of the best quality available. Our Angus beef are fed NO hormones, steroids or grains. We believe in taking care of our land, as to not overgraze, and we are continually rotating pastures.  We sell our beef by the quarter, half or whole. It is cut and wrapped to your specifications. If you really want to know where your beef comes from, call or e-mail Mark. References and tours available. Steelhammer Family Farms, LLC., Mark and Luanne Steelhammer, 16725 Marlu Lane SW, Rochester, WA 98579. (360) 273-7216 or (360) 280-3633, or toll-free: (800) 775-8733.  E-mail: steelhammerFarmilyFarms@gmail.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Rochester",
		"state": "Washington",
		"coordinates": [
			123.056941,
			46.845137,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86771"
	},
	"name": "Teddy Bear Farm",
	"description": "Teddy Bear Farm, located near Mount Spokane, has been family owned since 1944. We raise grass fed beef on natural grass and clover pastures.         Several local processors are available to process your half or whole beef to your specifications.         Teddy Bear Farm, Warren and Sylvia Riddle, 13616 E Mt. Spokane Drive, Mead WA 99021 (https://www.google.com/maps?q=13616+E+Mt.+Spokane+Drive,+Mead+WA+99021\u0026hl=en\u0026ll=47.802087,-117.221375\u0026spn=1.224993,2.798767\u0026sll=37.0625,-95.677068\u0026sspn=45.957536,89.560547\u0026hnear=13616+E+Mt+Spokane+Park+Dr,+Mead,+Washington+99021\u0026t=m\u0026z=9). (509) 464-4490. E-mail: info@teddybearfarm.biz.",
	"website": " http://www.teddybearfarm.biz.",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Mead",
		"state": "Washington",
		"coordinates": [
			117.222906,
			47.80222,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86772"
	},
	"name": "The Teas Ranch",
	"description": "The Teas Ranch is in the Okanagan Highlands. Our 670-acre farm provides live calves and cows as well as beef. We specialize in Highland Cattle, the oldest breed. Calves stay with their mothers for at least 4 months. Our animals don't do drugs. Whole, halves, and split halves of grassfed beef are available in September“October. Cows and calves are available year-round. Meat is marketed in September and October. Delivery can be made to Oroville. Please get your order in early. The Teas Ranch, \"Sy\" or Hattie Teas, 70 Teas Road, Oroville WA (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=70%20Teas%20Road%2C%20Oroville%20WA%2098844)  98844. (509) 485-4027.",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Oroville",
		"state": "Washington",
		"coordinates": [
			119.15471400000001,
			48.90322,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86773"
	},
	"name": "Thousand Hills Ranch",
	"description": "Thousand Hills                      Ranch Grass Finished Beef. We've raised the                      steaks! You like to eat beef and so do we. That's why our                      goal is to raise quality and nutritious grass fed/pasture                      finished beef from pasture to table, 100% antibiotic and                      hormone free.        Having been raised in the ranching industry we are        familiar with all aspects of cattle and raising quality beef. We have        found that beef tastes best and is best for you when cattle eat what        God designed them to eat.        We butcher twice yearly offering whole, half or quarters.        Our carcasses are in the 550-650 lb. range. For more  information, current pricing and dates about beef from our ranch,  please send us a note or give us a call.         We are a family-owned cow outfit, come visit the ranch in eastern        Washington.         Thousand Hills Ranch, Chane and Tricia Roghair, 23851          Highway 10, Cle Elum WA (http://www.google.com/maps?q=23851+Hwy+10,+Cle+Elum,+WA+98922,+USA\u0026sa=X\u0026oi=map\u0026ct=title). (509) 674-9529. E-mail: 72buckaroo@gmail.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Cle Elum",
		"state": "Washington",
		"coordinates": [
			120.817778,
			47.165509,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86774"
	},
	"name": "3-Bell Ranch, LLC",
	"description": "The 3-Bell Ranch, LLC is committed to sustainable  agriculture practices. We do not apply poison to our land. We use rotational  grazing strategies and natural fertilizers to produce our crops. We are not  certified organic but are strict with regard to our avoidance of toxins --  including GMO Frandkenfeeds or Frankenseeds.        We  sell        beef,         chicken,         Tamworth  and Tamworth-Duroc heritage weaner pigs, as well as  poly-culture  horse hay (tests low in sugar/ carbs and works well for even EMS horses) and rabbit. Please see our web site for availability of products.        Our  cows do not eat grain. They eat pasture or, when pasture is not available, our own farm-produced  hay. They are 100% grass-fed/finished. They  are born here and spend their entire lives on this property.         We are committed to humane treatment of our animals. We  raise our animals in rich social environments on quality pasture. We make every  effort to consider the physical, social and emotional well-being of our animals  from birth to death. Because  we are 4+ hours from the nearest USDA certified meat processing plant, and we  refuse to punish our animals with long trailer rides to a strange place in  order to be killed and butchered, we cannot offer our meat for sale at  restaurants, grocery stores or even the Farmer's Markets. Therefore, to  purchase any of our meat products, farm pick up is required at this time.  Visitors who come from longer distances are welcome to join us for an  over-night visit as our personal guests. Being on the ranch can provide you and  your family with a vacation as well as an opportunity to create a special bond  with the animals and people of The 3-Bell Ranch. 3-Bell Ranch, LLC, Tara Felder, Owner-Operator, PO BOX 328 / 24 Thayer Road South Oroville, WA 98844 (http://maps.google.com/maps?q=24+Thayer+Road+South,+Oroville,+WA+\u0026hl=en\u0026ll=48.831278,-119.429626\u0026spn=0.73857,1.783905\u0026sll=37.0625,-95.677068\u0026sspn=56.112526,114.169922\u0026vpsrc=6\u0026hnear=24+Thayer+South+Rd,+Oroville,+Washington+98844\u0026t=m\u0026z=10). (509) 560-4331   E-mail:  tara@communitynet.org.",
	"website": "  http://www.3BellsRanch.com",
	"products": [
		"Beef",
		"Chicken",
		"Pork",
		"Rabbit",
		"Weaner Pigs"
	],
	"location": {
		"city": "Oroville",
		"state": "Washington",
		"coordinates": [
			119.430239,
			48.831132,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86775"
	},
	"name": "3 Sisters Cattle Company",
	"description": "The 3 Sisters Cattle Company is                a grass fed/finished beef operation located on Whidbey Island. The Muzzall                Family has raised cattle on Whidbey Island for 98 years and the                three sisters are the fourth generation to call this home.                            We have 500 head of cattle and              raise the pasture, silage and hay for the beef. We               use no growth hormones or antibiotics. The meat is USDA certified.              You can purchase 1/4, 1/2, whole or individual cuts by the pound.              We dry age hang our beef for a minimum of 14 days.              3 Sisters Cattle Co is a locally owned sustainable            farm. Contact            us to buy, natural high quality grass fed beef from Whidbey Island.              3 Sisters Cattle Co., Shelly Muzzall, 938                Scenic Heights Road, Oak Harbor WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=938+Scenic+Heights+Road,+Oak+Harbor+WA\u0026sll=37.0625,-95.677068\u0026sspn=47.704107,53.349609\u0026ie=UTF8\u0026ll=48.246626,-122.667847\u0026spn=2.524099,3.334351\u0026z=8\u0026iwloc=addr) 98277. (360) 675-2136. E-mail: muzzall@aol.com (mailto:muzzall@aol.com).              ",
	"website": " http://www.3sistersbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Oak Harbor",
		"state": "Washington",
		"coordinates": [
			122.66518,
			48.2448,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86776"
	},
	"name": "Toboton Creek Enterprises",
	"description": "Toboton Creek Enterprises has been in               the business of raising Boer and Boer/Kiko cross bred goats               for about six years. In August 2006 we began offering USDA inspected               packaged goat meat.               We are proud of the naturally raised and hormone               free product coming from our pasture fed goats and have no lack               of customers ˜from the farm.™ Now we are offering our               excellent meat via the internet for those who want to enjoy healthy               eating. Goat meat is an excellent source of protein and is much               lower in saturated fat and cholesterol than most other meat sources.               Soon we will be able to cryovac our products and ship them any where.               We have also been approached and hope soon to have this home grown               meat served in restaurants. Visit our website for a price list.                         Toboton Creek Enterprises, 17847               Bald Hill Road SE, Yelm WA (http://www.google.com/maps?ie=UTF-8\u0026oe=UTF-8\u0026hl=en\u0026tab=wl\u0026q=17847%20Bald%20Hill%20Road%20SE%2C%20Yelm%2C%20WA%2098597) 98597               (360) 894-5691. E-mail: lyndants@ywave.com (mailto:lyndants@ywave.com).                             ",
	"website": " http://tobotoncreekenterprises.com/.",
	"products": "Goats",
	"location": {
		"city": "Yelm",
		"state": "Washington",
		"coordinates": [
			122.48368799999999,
			46.829486,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86777"
	},
	"name": "TreeBird Organics",
	"description": "TreeBird Organics.  Our Mission: TreeBird Organics aims to be a year-round source for local, organic and humanely raised food that is grown with environmental, social, and economic consciousness (the three tiers of sustainable farming). Our goals are to increase the sustainability of farming practices, create good jobs that pay living wages, have a transparent and welcoming farm that is open to the community, and support the education of children and consumers in what it means to have a sustainable food system. We practice inter-species farming and rotational grazing for the health of our pastures and animals. How We Stick to Our Mission From paying our team members a true living wage (over 1.5 times our state minimum wage) to feeding 100% certified organic feed, to adhering to the highest animal welfare standard the in country, we are setting the bar high for a new way of thinking about how our food is produced. Every part of how we structure our business and our days is rooted in our passion to ensure that what we do is a reflection of our respect and our beliefs in the natural world and the good of humanity. Where Can You Buy Our Products? Our Certified Organic and Animal Welfare Approved Eggs can be purchased in Hood River, OR at Rosauers, The Farm Stand in the Gorge and the Hood River Farmers Market. In White Salmon, WA at Feast Market and the White Salmon Farmers Market.  All of our products including eggs and organically fed beef / pork can be purchased here at the farm.  TreeBird Organics, Rebecca Wellman, Michael Kelly, Joanna Bakken, 573 Sunnyside Rd, Trout Lake WA 98650. 509-395-3600. E-mail: eatwell@treebirdorganics.com",
	"website": " treebirdorganics.com",
	"products": [
		"Beef",
		"Pork",
		"Eggs"
	],
	"location": {
		"city": "Trout Lake",
		"state": "Washington",
		"coordinates": [
			121.4749441,
			45.95693600000001,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86778"
	},
	"name": "Union Hill Grassed Beef",
	"description": "Union Hill Grassfed Beef raises a small herd on a 9-acre farm which rests within the footprint of an 1800s era dairy farm. Our mixed breed beef herd is free-range without growth hormones, antibiotics or insecticides beyond fly powder. We do not feed any grain or other supplements. Fodder includes garden and orchard leavings. We feed Ellensburg hay and alfalfa during the winter months and slaughter in early winter.  Sales are by the quarter (split half) or larger, in association with a local (Snohomish County) butcher who cuts, wraps and freezes. We sell by the hanging weight with no additional charges. Our beef is lean, yielding 55% to 75% depending on the size of the animal.  We do not ship or deliver. Visitors are welcome by arrangement.   Union Hill Grassfed Beef, Peter Hendrickson or Nancy Temkin, 7550 205th Avenue NE, Redmond WA 98053 (http://maps.google.com/maps?q=7550+205th+Avenue+NE,+Redmond+WA+98053\u0026hl=en\u0026ll=47.673479,-122.066689\u0026spn=0.197888,0.441513\u0026sll=37.0625,-95.677068\u0026sspn=58.685917,113.027344\u0026vpsrc=6\u0026hnear=7550+205th+Ave+NE,+Redmond,+Washington+98053\u0026t=m\u0026z=12). (206) 658-5930. E-mail: p.hendrickson43@gmail.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Redmond",
		"state": "Washington",
		"coordinates": [
			122.06664,
			47.673414,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f86779"
	},
	"name": "Vital Choice Wild Seafood \u0026 Organics",
	"description": "Wild salmon and other seafood, sockeye salmon oil supplements, organics berries, herbs \u0026 spices, teas, nuts, dark chocolate and more. Vital                Choice              was founded by a 20-year veteran Alaskan                salmon fisherman to provide consumers nation-wide with reliable                year-around access to premium quality wild-harvest seafood. The                company offers convenient home delivery of hard-to-find, environmentally                sustainable, health-promoting foods. These include premium fresh-frozen wild              salmon, halibut, sablefish, sardines, tuna, prawns, scallops, king              crab, and sockeye              salmon oil supplements, as well as organic              berries, herbs \u0026 spices,              teas, nuts, dark chocolate and more. Products sources are the              purest available and guaranteed sustainably harvested from healthy,              well-managed fisheries and farms.               Shipping is free on orders $99 and over, and              all orders are 100% satisfaction guaranteed.              Vital Choice is endorsed              by a large number of health experts and environmental organizations,              and a percentage of annual sales are donated to non profit organizations,              such as the Natural Resources Defense Counsel, The Marine Stewardship              Counsel, The Blue Ocean Institute, The Monterey Bay Aquarium, The              Live Strong Foundation, and others.              Vital Choice products are available              via our direct-mail catalog and website               or call our toll free number.              Our customer service operators are              available: Monday through Friday: 7 am to 5 pm Saturday 9-5 Sundays              10-5. (All times Pacific).             Vital Choice Wild Seafood \u0026 Organics, Randy              Hartnell, PO Box 4121, Bellingham              WA (http://maps.google.com/maps?f=q\u0026hl=en\u0026geocode=\u0026q=bellingham,+wa\u0026ie=UTF8\u0026ll=48.748945,-122.475586\u0026spn=4.614431,7.69043\u0026z=7\u0026iwloc=addr\u0026om=1) 98225. (800) 608-4825 (Customer              Service) or (360) 325-0104 (Office). E-mail: randy@vitalchoice.com (mailto:randy@vitalchoice.com).                            ",
	"website": " http://www.vitalchoice.com",
	"products": "Salmon",
	"location": {
		"city": "Bellingham",
		"state": "Washington",
		"coordinates": [
			122.47122,
			48.75235,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677a"
	},
	"name": "West Valley Beef",
	"description": "West Valley               Beef is committed to providing quality grass-fed beef while               maintaining the environment. Located in the fertile Snoqualmie Valley,               our beef are managed over 120 acres of lush green pasture and hay               ground. Our beef is 100% grass-fed and at no time are they fed grain,               by-products, or given growth hormones or other growth enhancers.              A third generation farming family, we are passionate               about farming and educating people about the importance of maintaining               the family farm and locally grown products.              Our animals are raised in a stress-free, calm               environment and are available by the 1/4, 1/2, or whole carcass               cut to your specifications by the butcher. Call or e-mail for more               information or to reserve your beef.              West Valley Beef, Chuck and Bobbi Lindemulder,               18817               West Snoqualmie Valley Road NE, Duvall WA 98019 (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=18817%20West%20Snoqualmie%20Valley%20Road%20NE%2C%20Duvall%20WA%2098019). (425) 788-1650                               E-mail: chucknbob@aol.com (mailto:chucknbob@aol.com).                             ",
	"website": " http://www.westvalleybeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Duvall",
		"state": "Washington",
		"coordinates": [
			122.00172,
			47.763294,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677b"
	},
	"name": "Windy N Ranch",
	"description": "Windy N Ranch, Ellensburg, WA. Beef, chickens (roasters and stewing hens), pheasants, pork, turkey, lamb, goat, chicken eggs and duck eggs.  Simply stated: clean food, animals do not do drugs, Certified Organic pastures, beef, pigs, goats, lamb, turkeys and pheasants, with chickens and ducks in the certification process. Animal Welfare Approved. One stop ranch for all your proteins. Come see for yourself.  Windy N Ranch is located in Eastern Washington™s Kittitas Valley, just outside Ellensburg and Central Washington University. One visit and you™ll know why we™re called the Windy N Ranch. The winds blow easterly from the Cascades, keeping our environment crisp, clean, and clear, as you can see from our views. We are committed to the humane treatment of all our animals as we strive to bring you the highest quality grassfed and pastured animal products including grassfed certified organic Wagyu (as in Kobe beef) / Black Angus Beef (exclusively grassfed), Freedom Ranger pastured meat Chickens aka pastured Poulet Rouge Chickens via France, pastured certified organic Ring-Necked Pheasants, pastured certified organic Pork, pastured certified organic heritage Thanksgiving Turkeys, pastured certified organic Lamb (exclusively grassfed), pastured certified organic Goat (exclusively grassfed), and real honest to goodness free-range chicken and duck Eggs.  Our animals browse our high quality native grasses as well as our own orchardgrass and alfalfa. They are never fed nor given antibiotics, growth hormones, steroids, stimulants or ionophores, and our fields do not receive herbicides or pesticides, bringing you a healthier product, lower in fat and higher in heart-healthy Omega-3 fatty acids and Conjugated Linoleic Acid.  Certifications, memberships and where our ranch is headed: Certified by Animal Welfare Approve”A tough certification to obtain and maintain. USDA Certified Organic”Beef, pigs, lambs, goats, turkeys, pheasants and pastures are Certified, with chickens to transition in the future. A tough certification to obtain and maintain.  Kittitas County Sheep Producers Member Washington Cattlemen's Association We treat our animals and customers with respect and welcome your visit to the Windy N Ranch for a tour. There is nothing like a firsthand visit to assure you of your food source. Please call or email us to make arrangements. Windy N Ranch, Greg and Laurie Newhall, 3650 Passmore Road, Ellensburg WA 98926. Ranch: (509) 962-4873. Mobile: (509) 607-0105.  E-mail: greg@windyNranch.com",
	"website": " http://www.windyNranch.com Check us out on Craig™s List as well.",
	"products": [
		"Beef",
		"Chicken",
		"Pheasants",
		"Pork",
		"Turkey",
		"Lamb",
		"Goat",
		"Eggs",
		"Duck Eggs"
	],
	"location": {
		"city": "Ellensburg",
		"state": "Washington",
		"coordinates": [
			120.6476,
			47.065457,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677c"
	},
	"name": "When Pigs Fly Farm",
	"description": "When Pigs Fly Farm is a small sustainable farm located south east of Mount Vernon, Washington. The gardens provide a wide variety of fresh produce as well as seasonal berries. The farm is shared with two Highland cows, forty laying hens, two gentleman horses, thousands of busy honey bees and Sam, our Shepherd. We have veggies, berries (strawberries, raspberries, blueberries and blackberries) apples, flowers, eggs and hopefully this year our first batch of honey. We use sustainable practices and our \"girls\" are on pasture except for at night. Then they are enclosed in a quarter-acre fenced yard with a coop so they have access to the outdoors all the time. Unlike some bee keepers, we do not feed our bees high fructose corn syrup. They are kept on their own honey over the winter which is why we had none our first year. We look forward to welcoming you for a visit, perhaps a class, or an overnight stay at the farm. You are welcome to participate with chores, help pick your own produce, and learn more about sustainable practices. When Pigs Fly Farm, Chris Hamer, 19997 Hwy 9, Mount Vernon, WA 98274. (360) 420-0606. E-mail: trainerhotline@msn.com",
	"website": " www.whenpigsflyorganics.com",
	"products": [
		"Eggs",
		"Produce",
		"Honey"
	],
	"location": {
		"city": "Mt. Vernon",
		"state": "Washington",
		"coordinates": [
			122.198441,
			48.3542569,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677d"
	},
	"name": "Wilcox Angus Beef",
	"description": "Wilcox Angus Beef is 100% grass fed, raised Angus beef on        certified organic pasture grass for direct local sales by quarter, 1/2        and whole beef.         Our cattle live on our century old Wilcox Family        Farm. We        consider ourselves a boutique ranch. We raise less than 100 Angus        beef on our pristine clover and timothy pastures. We practice sustainable        farming practices.         Our farm is certified Salmon Safe (that's important        because we own 2 miles of Nisqually Riverfront), pasture is certified        by the strict standards of Oregon Tilth, and Food Alliance Certified.        No added hormones. We service the Puget Sound Area.         Wilcox Angus Beef, Chris Wilcox, 40400 Harts Lake        Valley Road S, Roy        WA  (http://maps.google.com/maps?f=q\u0026source=s_q\u0026hl=en\u0026geocode=\u0026q=Roy+WA\u0026sll=46.899015,-122.473097\u0026sspn=0.00931,0.017982\u0026g=40400+Harts+Lake+Valley+Road+S,+Roy+WA\u0026ie=UTF8\u0026hq=\u0026hnear=Roy,+Pierce,+Washington\u0026ll=47.004264,-122.539846\u0026spn=2.378739,4.603271\u0026z=8)98580. (360) 481-3401. E-mail: cwilcoxorganicbeef@wilcoxfarms.net.       ",
	"website": " http://wilcoxangusbeef.com and http://www.nwgrassfed.com        Twitter: Grass_Fed_Beef_  Facebook: Wilcox Angus Beef",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Roy",
		"state": "Washington",
		"coordinates": [
			122.53984599999998,
			47.004264,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677e"
	},
	"name": "Whitaker Farms",
	"description": "Whitaker               Farms is located near Odessa WA where we graze cattle on open               range. In our closed herd calves are born, raised and finished on               the ranch. They live in clean pastures with fresh water and free-choice               of alfalfa grass hay.              We are a small, family-owned and operated ranch               committed to raising the healthiest beef possible. We have               been in the cattle business for over twenty years. Our mission is               to provide you with clean, wholesome grassfed beef, reliably delivered               to your freezer.              Whitaker cattle are grazed on natural and diverse               pastures. We don't use hormones or antibiotics and the pastures               are also free of chemical fertilizers and pesticides.              We believe that many food products on the market               today are not safe and that animals are not raised in a clean environment.               We feel that our product is safe from disease and bacteria because               we have a closed herd.              You can order from us by going to our website.               Credit cards are welcome.             Whitaker Grassfed Beef LLC, Richard Whitaker,               PO Box 551, Odessa               WA (http://www.google.com/maps?hl=en\u0026tab=wl\u0026q=Odessa%20WA%2099159)  99159. (509) 982-2028. E-mail: rich@whitakergrassfedbeef.com (mailto:rich@whitakergrassfedbeef.com).                             ",
	"website": " http://www.whitakergrassfedbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "Odessa",
		"state": "Washington",
		"coordinates": [
			118.68998000000002,
			47.33322,
			0.0
		]
	},
	"Price per lb": "10"
},
{
	"_id": {
		"$oid": "58cd9776c8d5c309d0f8677f"
	},
	"name": "Williamson Farms",
	"description": "Williamson               Farms is owned and operated by the Williamson family. We're               located in the Columbia Basin near George, Washington and blessed               with clear air, clean water, and fertile soils. The rain-shadow               of the Cascade Mountains and hot days with cool nights create a               high sugar content in plants. These are the keys to the Basin's               world-renowned delicious fruits, vegetables, high quality wines,               and now for our Grassfed Natural Beef, grown without antibiotics               or added hormones.               Our animals are raised year-round completely               on forage in the pasture. Depending on weather conditions, some               hay might be fed for a very short period, but absolutely no grain,               thus retaining the highest potential health benefits for you and               your family.              Emphasizing better conservation and stewardship,               our production techniques enhance the environment through innovative               rotational grazing, animal welfare, and sound agricultural practices,               creating a more sustainable agriculture both environmentally and               economically.               In order to receive your tender, juicy, 21-day-dry-aged               Grassfed Natural Beef with a delicious, distinctive flavor, or for               more information, contact us at the numbers below. Credit cards               are accepted.               Williamson Farms, PO Box 5245, George               WA (http://www.mapquest.com/maps/map.adp?country=US\u0026address=\u0026city=George\u0026state=WA)  98824. Toll-free:                (888) 881-5731. E-mail: info@grassfednaturalbeef.com (mailto:info@grassfednaturalbeef.com)                              ",
	"website": " http://www.grassfednaturalbeef.com",
	"products": [
		"Beef"
	],
	"location": {
		"city": "George",
		"state": "Washington",
		"coordinates": [
			119.85654000000001,
			47.08112,
			0.0
		]
	},
	"Price per lb": "10"
}]

